theatrus/ksdk/platform/devices/MKV43F15/include/MKV43F15_extension.h
/*******************************************************************************
 * ADC_CTRL2 - ADC Control Register 2
 ******************************************************************************/

/*!
 * @brief ADC_CTRL2 - ADC Control Register 2 (RW)
 *
 * Reset value: 0x5044U
 */
/*!
 * @name Constants and macros for entire ADC_CTRL2 register
 */
/*@{*/
#define ADC_RD_CTRL2(base)       (ADC_CTRL2_REG(base))
#define ADC_WR_CTRL2(base, value) (ADC_CTRL2_REG(base) = (value))
#define ADC_RMW_CTRL2(base, mask, value) (ADC_WR_CTRL2(base, (ADC_RD_CTRL2(base) & ~(mask)) | (value)))
#define ADC_SET_CTRL2(base, value) (ADC_WR_CTRL2(base, ADC_RD_CTRL2(base) |  (value)))
#define ADC_CLR_CTRL2(base, value) (ADC_WR_CTRL2(base, ADC_RD_CTRL2(base) & ~(value)))
#define ADC_TOG_CTRL2(base, value) (ADC_WR_CTRL2(base, ADC_RD_CTRL2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CTRL2 bitfields
 */

/*!
 * @name Register ADC_CTRL2, field DIV0[5:0] (RW)
 *
 * The divider circuit generates the ADC clock by dividing the system clock:
 * When DIV0 is 0, the divisor is 2. For all other DIV0 values, the divisor is 1
 * more than the decimal value of DIV0: (DIV0)Â +Â 1d. A DIV0 value must be chosen
 * so the ADC clock does not exceed the maximum frequency. This clock is used by
 * ADCA during all scans and is used by ADCB during sequential scan modes and
 * during parallel simultaneous scan modes.
 */
/*@{*/
/*! @brief Read current value of the ADC_CTRL2_DIV0 field. */
#define ADC_RD_CTRL2_DIV0(base) ((ADC_CTRL2_REG(base) & ADC_CTRL2_DIV0_MASK) >> ADC_CTRL2_DIV0_SHIFT)
#define ADC_BRD_CTRL2_DIV0(base) (ADC_RD_CTRL2_DIV0(base))

/*! @brief Set the DIV0 field to a new value. */
#define ADC_WR_CTRL2_DIV0(base, value) (ADC_RMW_CTRL2(base, ADC_CTRL2_DIV0_MASK, ADC_CTRL2_DIV0(value)))
#define ADC_BWR_CTRL2_DIV0(base, value) (ADC_WR_CTRL2_DIV0(base, value))
/*@}*/

/*!
 * @name Register ADC_CTRL2, field SIMULT[6] (RW)
 *
 * This bit only affects parallel scan modes. By default (CTRL2[SIMULT]=1)
 * parallel scans operate in simultaneous mode. The scans in the A and B converter
 * operate simultaneously and always result in pairs of simultaneous conversions in
 * the A and B converter. CTRL1[STOP0, SYNC0, and START0] control bits and the
 * SYNC0 input are used to start and stop scans in both converters simultaneously.
 * A scan ends in both converters when either converter encounters a disabled
 * sample slot. When the parallel scan completes, the STAT[EOSI0] triggers if
 * CTRL1[EOSIE0] is set. The STAT[CIP0] status bit indicates that a parallel scan is in
 * process. When CTRL2[SIMULT]=0, parallel scans in the A and B converters
 * operate independently. The B converter has its own independent set of the above
 * controls (with a 1 suffix) which control its operation and report its status.
 * Each converter's scan continues until its sample list is exhausted (8 samples) or
 * a disabled sample IN ITS LIST is encountered. For looping parallel scan mode,
 * each converter starts its next iteration as soon as the previous iteration in
 * that converter is complete and continues until the CTRL*[STOP*] bit for that
 * converter is asserted.
 *
 * Values:
 * - 0 - Parallel scans done independently
 * - 1 - Parallel scans done simultaneously (default)
 */
/*@{*/
/*! @brief Read current value of the ADC_CTRL2_SIMULT field. */
#define ADC_RD_CTRL2_SIMULT(base) ((ADC_CTRL2_REG(base) & ADC_CTRL2_SIMULT_MASK) >> ADC_CTRL2_SIMULT_SHIFT)
#define ADC_BRD_CTRL2_SIMULT(base) (BITBAND_ACCESS16(&ADC_CTRL2_REG(base), ADC_CTRL2_SIMULT_SHIFT))

/*! @brief Set the SIMULT field to a new value. */
#define ADC_WR_CTRL2_SIMULT(base, value) (ADC_RMW_CTRL2(base, ADC_CTRL2_SIMULT_MASK, ADC_CTRL2_SIMULT(value)))
#define ADC_BWR_CTRL2_SIMULT(base, value) (BITBAND_ACCESS16(&ADC_CTRL2_REG(base), ADC_CTRL2_SIMULT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_CTRL2, field CHNCFG_H[10:7] (RW)
 *
 * The bits configure the analog inputs for either single ended or differential
 * conversions. Differential measurements return the max value ((2**12)-1) when
 * the + input is VREFH and the - input is VREFLO, return 0 when the + input is at
 * VREFLO and the - input is at VREFH, and scale linearly between based on the
 * voltage difference between the two signals. Single ended measurements return
 * the max value when the input is at VREFH, return 0 when the input is at VREFLO ,
 * and scale linearly between based on the amount by which the input exceeds
 * VREFLO. xxx1 Inputs = ANA4-ANA5 - Configured as differential pair (ANA4 is + and
 * ANA5 is -) xxx0 Inputs = ANA4-ANA5 - Both configured as single ended inputs
 * xx1x Inputs = ANA6-ANA7 - Configured as differential pair (ANA6 is + and ANA7 is
 * -) xx0x Inputs = ANA6-ANA7 - Both configured as single ended inputs x1xx
 * Inputs = ANB4-ANB5 - Configured as differential pair (ANB4 is + and ANB5 is -)
 * x0xx Inputs = ANB4-ANB5 - Both configured as single ended inputs 1xxx Inputs =
 * ANB6-ANB7 - Configured as differential pair (ANB6 is + and ANB7 is -) 0xxx
 * Inputs = ANB6-ANB7 - Both configured as single ended inputs
 */
/*@{*/
/*! @brief Read current value of the ADC_CTRL2_CHNCFG_H field. */
#define ADC_RD_CTRL2_CHNCFG_H(base) ((ADC_CTRL2_REG(base) & ADC_CTRL2_CHNCFG_H_MASK) >> ADC_CTRL2_CHNCFG_H_SHIFT)
#define ADC_BRD_CTRL2_CHNCFG_H(base) (ADC_RD_CTRL2_CHNCFG_H(base))

/*! @brief Set the CHNCFG_H field to a new value. */
#define ADC_WR_CTRL2_CHNCFG_H(base, value) (ADC_RMW_CTRL2(base, ADC_CTRL2_CHNCFG_H_MASK, ADC_CTRL2_CHNCFG_H(value)))
#define ADC_BWR_CTRL2_CHNCFG_H(base, value) (ADC_WR_CTRL2_CHNCFG_H(base, value))
/*@}*/

/*!
 * @name Register ADC_CTRL2, field EOSIE1[11] (RW)
 *
 * During parallel scan modes when SIMULT = 0, this bit enables interrupt
 * control for a B converter parallel scan. This bit enables an EOSI1 interrupt to be
 * generated upon completion of the scan. For looping scan modes, the interrupt
 * will trigger after the completion of each iteration of the loop.
 *
 * Values:
 * - 0 - Interrupt disabled
 * - 1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the ADC_CTRL2_EOSIE1 field. */
#define ADC_RD_CTRL2_EOSIE1(base) ((ADC_CTRL2_REG(base) & ADC_CTRL2_EOSIE1_MASK) >> ADC_CTRL2_EOSIE1_SHIFT)
#define ADC_BRD_CTRL2_EOSIE1(base) (BITBAND_ACCESS16(&ADC_CTRL2_REG(base), ADC_CTRL2_EOSIE1_SHIFT))

/*! @brief Set the EOSIE1 field to a new value. */
#define ADC_WR_CTRL2_EOSIE1(base, value) (ADC_RMW_CTRL2(base, ADC_CTRL2_EOSIE1_MASK, ADC_CTRL2_EOSIE1(value)))
#define ADC_BWR_CTRL2_EOSIE1(base, value) (BITBAND_ACCESS16(&ADC_CTRL2_REG(base), ADC_CTRL2_EOSIE1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_CTRL2, field SYNC1[12] (RW)
 *
 * During parallel scan modes when CTRL2[SIMULT]=0, setting this bit to 1
 * permits a B converter parallel scan to be initiated by asserting the SYNC1 input for
 * at least one ADC clock cycle. CTRL2[SYNC1] is cleared in ONCE mode,
 * CTRL1[SMODE=000 or 001], when the first SYNC input is detected. This prevents
 * unintentionally starting a new scan after the first scan has completed. The ADC must be
 * in a stable power mode prior to SYNC1 input assertion. Refer to the
 * functional description of power modes for further details. In "once" scan modes, only a
 * first SYNC1 input pulse is honored. CTRL2[SYNC1] is cleared in this mode when
 * the first SYNC1 input is detected. This prevents unintentionally starting a
 * new scan after the first scan has completed. The CTRL2[SYNC1] bit can be set
 * again at any time including while the scan remains in process.
 *
 * Values:
 * - 0 - B converter parallel scan is initiated by a write to CTRL2[START1] bit
 *     only
 * - 1 - Use a SYNC1 input pulse or CTRL2[START1] bit to initiate a B converter
 *     parallel scan
 */
/*@{*/
/*! @brief Read current value of the ADC_CTRL2_SYNC1 field. */
#define ADC_RD_CTRL2_SYNC1(base) ((ADC_CTRL2_REG(base) & ADC_CTRL2_SYNC1_MASK) >> ADC_CTRL2_SYNC1_SHIFT)
#define ADC_BRD_CTRL2_SYNC1(base) (BITBAND_ACCESS16(&ADC_CTRL2_REG(base), ADC_CTRL2_SYNC1_SHIFT))

/*! @brief Set the SYNC1 field to a new value. */
#define ADC_WR_CTRL2_SYNC1(base, value) (ADC_RMW_CTRL2(base, ADC_CTRL2_SYNC1_MASK, ADC_CTRL2_SYNC1(value)))
#define ADC_BWR_CTRL2_SYNC1(base, value) (BITBAND_ACCESS16(&ADC_CTRL2_REG(base), ADC_CTRL2_SYNC1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_CTRL2, field START1[13] (WORZ)
 *
 * During parallel scan modes when SIMULT = 0, this bit enables start control of
 * a B converter parallel scan. A scan is started by writing 1 to this bit. This
 * is a write only bit. Writing 1 to it again while the scan remains in process,
 * is ignored. The ADC must be in a stable power configuration prior to writing
 * the start bit. Refer to the functional description of power modes for further
 * details.
 *
 * Values:
 * - 0 - No action
 * - 1 - Start command is issued
 */
/*@{*/
/*! @brief Set the START1 field to a new value. */
#define ADC_WR_CTRL2_START1(base, value) (ADC_RMW_CTRL2(base, ADC_CTRL2_START1_MASK, ADC_CTRL2_START1(value)))
#define ADC_BWR_CTRL2_START1(base, value) (BITBAND_ACCESS16(&ADC_CTRL2_REG(base), ADC_CTRL2_START1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_CTRL2, field STOP1[14] (RW)
 *
 * During parallel scan modes when SIMULT = 0, this bit enables stop control of
 * a B converter parallel scan. When this bit is asserted, the current scan is
 * stopped and no further scans can start. Any further SYNC1 input pulses (see
 * CTRL2[SYNC1] bit) or writes to the CTRL2[START1] bit are ignored until this bit
 * has been cleared. After the ADC is in stop mode, the results registers can be
 * modified by the processor. Any changes to the result registers in stop mode are
 * treated as if the analog core supplied the data. Therefore, limit checking,
 * zero crossing, and associated interrupts can occur when authorized. This is not
 * the same as DSP STOP mode.
 *
 * Values:
 * - 0 - Normal operation
 * - 1 - Stop mode
 */
/*@{*/
/*! @brief Read current value of the ADC_CTRL2_STOP1 field. */
#define ADC_RD_CTRL2_STOP1(base) ((ADC_CTRL2_REG(base) & ADC_CTRL2_STOP1_MASK) >> ADC_CTRL2_STOP1_SHIFT)
#define ADC_BRD_CTRL2_STOP1(base) (BITBAND_ACCESS16(&ADC_CTRL2_REG(base), ADC_CTRL2_STOP1_SHIFT))

/*! @brief Set the STOP1 field to a new value. */
#define ADC_WR_CTRL2_STOP1(base, value) (ADC_RMW_CTRL2(base, ADC_CTRL2_STOP1_MASK, ADC_CTRL2_STOP1(value)))
#define ADC_BWR_CTRL2_STOP1(base, value) (BITBAND_ACCESS16(&ADC_CTRL2_REG(base), ADC_CTRL2_STOP1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_CTRL2, field DMAEN1[15] (RW)
 *
 * During parallel scan modes when SIMULT=0, this bit enables DMA for converter
 * B. When this bit is asserted, the DMA source selected by CTRL3[DMASRC] causes
 * the conversion results to be transferred by the DMA controller. Setting this
 * bit blocks EOSI1 interrupts generation.
 *
 * Values:
 * - 0 - DMA is not enabled.
 * - 1 - DMA is enabled.
 */
/*@{*/
/*! @brief Read current value of the ADC_CTRL2_DMAEN1 field. */
#define ADC_RD_CTRL2_DMAEN1(base) ((ADC_CTRL2_REG(base) & ADC_CTRL2_DMAEN1_MASK) >> ADC_CTRL2_DMAEN1_SHIFT)
#define ADC_BRD_CTRL2_DMAEN1(base) (BITBAND_ACCESS16(&ADC_CTRL2_REG(base), ADC_CTRL2_DMAEN1_SHIFT))

