theatrus/ksdk/platform/devices/MKV43F15/include/MKV43F15_extension.h
/*******************************************************************************
 * ADC_CLIST3 - ADC Channel List Register 3
 ******************************************************************************/

/*!
 * @brief ADC_CLIST3 - ADC Channel List Register 3 (RW)
 *
 * Reset value: 0xBA98U
 */
/*!
 * @name Constants and macros for entire ADC_CLIST3 register
 */
/*@{*/
#define ADC_RD_CLIST3(base)      (ADC_CLIST3_REG(base))
#define ADC_WR_CLIST3(base, value) (ADC_CLIST3_REG(base) = (value))
#define ADC_RMW_CLIST3(base, mask, value) (ADC_WR_CLIST3(base, (ADC_RD_CLIST3(base) & ~(mask)) | (value)))
#define ADC_SET_CLIST3(base, value) (ADC_WR_CLIST3(base, ADC_RD_CLIST3(base) |  (value)))
#define ADC_CLR_CLIST3(base, value) (ADC_WR_CLIST3(base, ADC_RD_CLIST3(base) & ~(value)))
#define ADC_TOG_CLIST3(base, value) (ADC_WR_CLIST3(base, ADC_RD_CLIST3(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLIST3 bitfields
 */

/*!
 * @name Register ADC_CLIST3, field SAMPLE8[3:0] (RW)
 *
 * Values:
 * - 0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the ADC_CLIST3_SAMPLE8 field. */
#define ADC_RD_CLIST3_SAMPLE8(base) ((ADC_CLIST3_REG(base) & ADC_CLIST3_SAMPLE8_MASK) >> ADC_CLIST3_SAMPLE8_SHIFT)
#define ADC_BRD_CLIST3_SAMPLE8(base) (ADC_RD_CLIST3_SAMPLE8(base))

/*! @brief Set the SAMPLE8 field to a new value. */
#define ADC_WR_CLIST3_SAMPLE8(base, value) (ADC_RMW_CLIST3(base, ADC_CLIST3_SAMPLE8_MASK, ADC_CLIST3_SAMPLE8(value)))
#define ADC_BWR_CLIST3_SAMPLE8(base, value) (ADC_WR_CLIST3_SAMPLE8(base, value))
/*@}*/

/*!
 * @name Register ADC_CLIST3, field SAMPLE9[7:4] (RW)
 *
 * Values:
 * - 0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the ADC_CLIST3_SAMPLE9 field. */
#define ADC_RD_CLIST3_SAMPLE9(base) ((ADC_CLIST3_REG(base) & ADC_CLIST3_SAMPLE9_MASK) >> ADC_CLIST3_SAMPLE9_SHIFT)
#define ADC_BRD_CLIST3_SAMPLE9(base) (ADC_RD_CLIST3_SAMPLE9(base))

/*! @brief Set the SAMPLE9 field to a new value. */
#define ADC_WR_CLIST3_SAMPLE9(base, value) (ADC_RMW_CLIST3(base, ADC_CLIST3_SAMPLE9_MASK, ADC_CLIST3_SAMPLE9(value)))
#define ADC_BWR_CLIST3_SAMPLE9(base, value) (ADC_WR_CLIST3_SAMPLE9(base, value))
/*@}*/

/*!
 * @name Register ADC_CLIST3, field SAMPLE10[11:8] (RW)
 *
 * Values:
 * - 0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the ADC_CLIST3_SAMPLE10 field. */
#define ADC_RD_CLIST3_SAMPLE10(base) ((ADC_CLIST3_REG(base) & ADC_CLIST3_SAMPLE10_MASK) >> ADC_CLIST3_SAMPLE10_SHIFT)
#define ADC_BRD_CLIST3_SAMPLE10(base) (ADC_RD_CLIST3_SAMPLE10(base))

/*! @brief Set the SAMPLE10 field to a new value. */
#define ADC_WR_CLIST3_SAMPLE10(base, value) (ADC_RMW_CLIST3(base, ADC_CLIST3_SAMPLE10_MASK, ADC_CLIST3_SAMPLE10(value)))
#define ADC_BWR_CLIST3_SAMPLE10(base, value) (ADC_WR_CLIST3_SAMPLE10(base, value))
/*@}*/

/*!
 * @name Register ADC_CLIST3, field SAMPLE11[15:12] (RW)
 *
 * Values:
 * - 0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the ADC_CLIST3_SAMPLE11 field. */
#define ADC_RD_CLIST3_SAMPLE11(base) ((ADC_CLIST3_REG(base) & ADC_CLIST3_SAMPLE11_MASK) >> ADC_CLIST3_SAMPLE11_SHIFT)
#define ADC_BRD_CLIST3_SAMPLE11(base) (ADC_RD_CLIST3_SAMPLE11(base))

/*! @brief Set the SAMPLE11 field to a new value. */
#define ADC_WR_CLIST3_SAMPLE11(base, value) (ADC_RMW_CLIST3(base, ADC_CLIST3_SAMPLE11_MASK, ADC_CLIST3_SAMPLE11(value)))
#define ADC_BWR_CLIST3_SAMPLE11(base, value) (ADC_WR_CLIST3_SAMPLE11(base, value))
/*@}*/

