theatrus/ksdk/platform/devices/MKV43F15/include/MKV43F15_extension.h
/*******************************************************************************
 * ADC_CLIST4 - ADC Channel List Register 4
 ******************************************************************************/

/*!
 * @brief ADC_CLIST4 - ADC Channel List Register 4 (RW)
 *
 * Reset value: 0xFEDCU
 */
/*!
 * @name Constants and macros for entire ADC_CLIST4 register
 */
/*@{*/
#define ADC_RD_CLIST4(base)      (ADC_CLIST4_REG(base))
#define ADC_WR_CLIST4(base, value) (ADC_CLIST4_REG(base) = (value))
#define ADC_RMW_CLIST4(base, mask, value) (ADC_WR_CLIST4(base, (ADC_RD_CLIST4(base) & ~(mask)) | (value)))
#define ADC_SET_CLIST4(base, value) (ADC_WR_CLIST4(base, ADC_RD_CLIST4(base) |  (value)))
#define ADC_CLR_CLIST4(base, value) (ADC_WR_CLIST4(base, ADC_RD_CLIST4(base) & ~(value)))
#define ADC_TOG_CLIST4(base, value) (ADC_WR_CLIST4(base, ADC_RD_CLIST4(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLIST4 bitfields
 */

/*!
 * @name Register ADC_CLIST4, field SAMPLE12[3:0] (RW)
 *
 * Values:
 * - 0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the ADC_CLIST4_SAMPLE12 field. */
#define ADC_RD_CLIST4_SAMPLE12(base) ((ADC_CLIST4_REG(base) & ADC_CLIST4_SAMPLE12_MASK) >> ADC_CLIST4_SAMPLE12_SHIFT)
#define ADC_BRD_CLIST4_SAMPLE12(base) (ADC_RD_CLIST4_SAMPLE12(base))

/*! @brief Set the SAMPLE12 field to a new value. */
#define ADC_WR_CLIST4_SAMPLE12(base, value) (ADC_RMW_CLIST4(base, ADC_CLIST4_SAMPLE12_MASK, ADC_CLIST4_SAMPLE12(value)))
#define ADC_BWR_CLIST4_SAMPLE12(base, value) (ADC_WR_CLIST4_SAMPLE12(base, value))
/*@}*/

/*!
 * @name Register ADC_CLIST4, field SAMPLE13[7:4] (RW)
 *
 * Values:
 * - 0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the ADC_CLIST4_SAMPLE13 field. */
#define ADC_RD_CLIST4_SAMPLE13(base) ((ADC_CLIST4_REG(base) & ADC_CLIST4_SAMPLE13_MASK) >> ADC_CLIST4_SAMPLE13_SHIFT)
#define ADC_BRD_CLIST4_SAMPLE13(base) (ADC_RD_CLIST4_SAMPLE13(base))

/*! @brief Set the SAMPLE13 field to a new value. */
#define ADC_WR_CLIST4_SAMPLE13(base, value) (ADC_RMW_CLIST4(base, ADC_CLIST4_SAMPLE13_MASK, ADC_CLIST4_SAMPLE13(value)))
#define ADC_BWR_CLIST4_SAMPLE13(base, value) (ADC_WR_CLIST4_SAMPLE13(base, value))
/*@}*/

/*!
 * @name Register ADC_CLIST4, field SAMPLE14[11:8] (RW)
 *
 * Values:
 * - 0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the ADC_CLIST4_SAMPLE14 field. */
#define ADC_RD_CLIST4_SAMPLE14(base) ((ADC_CLIST4_REG(base) & ADC_CLIST4_SAMPLE14_MASK) >> ADC_CLIST4_SAMPLE14_SHIFT)
#define ADC_BRD_CLIST4_SAMPLE14(base) (ADC_RD_CLIST4_SAMPLE14(base))

/*! @brief Set the SAMPLE14 field to a new value. */
#define ADC_WR_CLIST4_SAMPLE14(base, value) (ADC_RMW_CLIST4(base, ADC_CLIST4_SAMPLE14_MASK, ADC_CLIST4_SAMPLE14(value)))
#define ADC_BWR_CLIST4_SAMPLE14(base, value) (ADC_WR_CLIST4_SAMPLE14(base, value))
/*@}*/

/*!
 * @name Register ADC_CLIST4, field SAMPLE15[15:12] (RW)
 *
 * Values:
 * - 0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the ADC_CLIST4_SAMPLE15 field. */
#define ADC_RD_CLIST4_SAMPLE15(base) ((ADC_CLIST4_REG(base) & ADC_CLIST4_SAMPLE15_MASK) >> ADC_CLIST4_SAMPLE15_SHIFT)
#define ADC_BRD_CLIST4_SAMPLE15(base) (ADC_RD_CLIST4_SAMPLE15(base))

/*! @brief Set the SAMPLE15 field to a new value. */
#define ADC_WR_CLIST4_SAMPLE15(base, value) (ADC_RMW_CLIST4(base, ADC_CLIST4_SAMPLE15_MASK, ADC_CLIST4_SAMPLE15(value)))
#define ADC_BWR_CLIST4_SAMPLE15(base, value) (ADC_WR_CLIST4_SAMPLE15(base, value))
/*@}*/

