theatrus/ksdk/platform/devices/MKV43F15/include/MKV43F15_extension.h
/*******************************************************************************
 * ADC_RDY - ADC Ready Register
 ******************************************************************************/

/*!
 * @brief ADC_RDY - ADC Ready Register (RO)
 *
 * Reset value: 0x0000U
 *
 * This register provides the current status of the ADC conversions. RDY[RDYx]
 * bits are cleared by reading their corresponding result registers (RSLTx).
 */
/*!
 * @name Constants and macros for entire ADC_RDY register
 */
/*@{*/
#define ADC_RD_RDY(base)         (ADC_RDY_REG(base))
/*@}*/

/*******************************************************************************
 * ADC_LOLIMSTAT - ADC Low Limit Status Register
 ******************************************************************************/

/*!
 * @brief ADC_LOLIMSTAT - ADC Low Limit Status Register (W1C)
 *
 * Reset value: 0x0000U
 *
 * The low limit status register latches in the result of the comparison between
 * the result of the sample and the respective low limit register, LOLIM0-15.
 * Here is an example: If the result for the channel programmed in CLIST1[SAMPLE0]
 * is lower than the value programmed into the Low Limit Register zero, then the
 * LIMSTAT[LLS0] bit is set to one. An interrupt is generated if the
 * CTRL1[LLMTIE] bit is set. These bits are sticky. They are not cleared automatically by
 * subsequent conversions. Each bit is cleared only by writing a value of one to
 * that specific bit.
 */
/*!
 * @name Constants and macros for entire ADC_LOLIMSTAT register
 */
/*@{*/
#define ADC_RD_LOLIMSTAT(base)   (ADC_LOLIMSTAT_REG(base))
#define ADC_WR_LOLIMSTAT(base, value) (ADC_LOLIMSTAT_REG(base) = (value))
#define ADC_RMW_LOLIMSTAT(base, mask, value) (ADC_WR_LOLIMSTAT(base, (ADC_RD_LOLIMSTAT(base) & ~(mask)) | (value)))
#define ADC_SET_LOLIMSTAT(base, value) (ADC_WR_LOLIMSTAT(base, ADC_RD_LOLIMSTAT(base) |  (value)))
#define ADC_CLR_LOLIMSTAT(base, value) (ADC_WR_LOLIMSTAT(base, ADC_RD_LOLIMSTAT(base) & ~(value)))
#define ADC_TOG_LOLIMSTAT(base, value) (ADC_WR_LOLIMSTAT(base, ADC_RD_LOLIMSTAT(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ADC_HILIMSTAT - ADC High Limit Status Register
 ******************************************************************************/

/*!
 * @brief ADC_HILIMSTAT - ADC High Limit Status Register (W1C)
 *
 * Reset value: 0x0000U
 *
 * The high limit status register latches in the result of the comparison
 * between the result of the sample and the respective high limit register, HILIM0-15.
 * Here is an example: If the result for the channel programmed in
 * CLIST1[SAMPLE0] is greater than the value programmed into the High Limit Register zero, then
 * the LIMSTAT[HLS0] bit is set to one. An interrupt is generated if the
 * CTRL1[HLMTIE] bit is set. These bits are sticky. They are not cleared automatically
 * by subsequent conversions. Each bit is cleared only by writing a value of one
 * to that specific bit.
 */
/*!
 * @name Constants and macros for entire ADC_HILIMSTAT register
 */
/*@{*/
#define ADC_RD_HILIMSTAT(base)   (ADC_HILIMSTAT_REG(base))
#define ADC_WR_HILIMSTAT(base, value) (ADC_HILIMSTAT_REG(base) = (value))
#define ADC_RMW_HILIMSTAT(base, mask, value) (ADC_WR_HILIMSTAT(base, (ADC_RD_HILIMSTAT(base) & ~(mask)) | (value)))
#define ADC_SET_HILIMSTAT(base, value) (ADC_WR_HILIMSTAT(base, ADC_RD_HILIMSTAT(base) |  (value)))
#define ADC_CLR_HILIMSTAT(base, value) (ADC_WR_HILIMSTAT(base, ADC_RD_HILIMSTAT(base) & ~(value)))
#define ADC_TOG_HILIMSTAT(base, value) (ADC_WR_HILIMSTAT(base, ADC_RD_HILIMSTAT(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ADC_ZXSTAT - ADC Zero Crossing Status Register
 ******************************************************************************/

/*!
 * @brief ADC_ZXSTAT - ADC Zero Crossing Status Register (W1C)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ADC_ZXSTAT register
 */
/*@{*/
#define ADC_RD_ZXSTAT(base)      (ADC_ZXSTAT_REG(base))
#define ADC_WR_ZXSTAT(base, value) (ADC_ZXSTAT_REG(base) = (value))
#define ADC_RMW_ZXSTAT(base, mask, value) (ADC_WR_ZXSTAT(base, (ADC_RD_ZXSTAT(base) & ~(mask)) | (value)))
#define ADC_SET_ZXSTAT(base, value) (ADC_WR_ZXSTAT(base, ADC_RD_ZXSTAT(base) |  (value)))
#define ADC_CLR_ZXSTAT(base, value) (ADC_WR_ZXSTAT(base, ADC_RD_ZXSTAT(base) & ~(value)))
#define ADC_TOG_ZXSTAT(base, value) (ADC_WR_ZXSTAT(base, ADC_RD_ZXSTAT(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ADC_RSLT - ADC Result Registers with sign extension
 ******************************************************************************/

/*!
 * @brief ADC_RSLT - ADC Result Registers with sign extension (RW)
 *
 * Reset value: 0x0000U
 *
 * The result registers contain the converted results from a scan. The
 * CLIST1[SAMPLE0] result is loaded into RSLT0, CLIST1[SAMPLE1] result in RSLT1, and so
 * on. In a parallel scan mode, the first channel pair designated by
 * CLIST1[SAMPLE0] and CLIST3[SAMPLE8] are stored in RSLT0 and RSLT8, respectively. When
 * writing to this register, only the RSLT portion of the value written is used. This
 * value is modified and the result of the subtraction is stored. The SEXT bit is
 * only set as a result of this subtraction and is not directly determined by the
 * value written.
 */
/*!
 * @name Constants and macros for entire ADC_RSLT register
 */
/*@{*/
#define ADC_RD_RSLT(base, index) (ADC_RSLT_REG(base, index))
#define ADC_WR_RSLT(base, index, value) (ADC_RSLT_REG(base, index) = (value))
#define ADC_RMW_RSLT(base, index, mask, value) (ADC_WR_RSLT(base, index, (ADC_RD_RSLT(base, index) & ~(mask)) | (value)))
#define ADC_SET_RSLT(base, index, value) (ADC_WR_RSLT(base, index, ADC_RD_RSLT(base, index) |  (value)))
#define ADC_CLR_RSLT(base, index, value) (ADC_WR_RSLT(base, index, ADC_RD_RSLT(base, index) & ~(value)))
#define ADC_TOG_RSLT(base, index, value) (ADC_WR_RSLT(base, index, ADC_RD_RSLT(base, index) ^  (value)))
/*@}*/

