theatrus/ksdk/platform/devices/MKV43F15/include/MKV43F15_extension.h
/*******************************************************************************
 * ADC_CAL - ADC Calibration Register
 ******************************************************************************/

/*!
 * @brief ADC_CAL - ADC Calibration Register (RW)
 *
 * Reset value: 0x0000U
 *
 * The ADC provides for off-chip references that can be used for ADC conversions.
 */
/*!
 * @name Constants and macros for entire ADC_CAL register
 */
/*@{*/
#define ADC_RD_CAL(base)         (ADC_CAL_REG(base))
#define ADC_WR_CAL(base, value)  (ADC_CAL_REG(base) = (value))
#define ADC_RMW_CAL(base, mask, value) (ADC_WR_CAL(base, (ADC_RD_CAL(base) & ~(mask)) | (value)))
#define ADC_SET_CAL(base, value) (ADC_WR_CAL(base, ADC_RD_CAL(base) |  (value)))
#define ADC_CLR_CAL(base, value) (ADC_WR_CAL(base, ADC_RD_CAL(base) & ~(value)))
#define ADC_TOG_CAL(base, value) (ADC_WR_CAL(base, ADC_RD_CAL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CAL bitfields
 */

/*!
 * @name Register ADC_CAL, field SEL_VREFLO_A[12] (RW)
 *
 * This bit selects the source of the VREFLO reference for all conversions in
 * converter 0.
 *
 * Values:
 * - 0 - VREFL pad
 * - 1 - ANA3
 */
/*@{*/
/*! @brief Read current value of the ADC_CAL_SEL_VREFLO_A field. */
#define ADC_RD_CAL_SEL_VREFLO_A(base) ((ADC_CAL_REG(base) & ADC_CAL_SEL_VREFLO_A_MASK) >> ADC_CAL_SEL_VREFLO_A_SHIFT)
#define ADC_BRD_CAL_SEL_VREFLO_A(base) (BITBAND_ACCESS16(&ADC_CAL_REG(base), ADC_CAL_SEL_VREFLO_A_SHIFT))

/*! @brief Set the SEL_VREFLO_A field to a new value. */
#define ADC_WR_CAL_SEL_VREFLO_A(base, value) (ADC_RMW_CAL(base, ADC_CAL_SEL_VREFLO_A_MASK, ADC_CAL_SEL_VREFLO_A(value)))
#define ADC_BWR_CAL_SEL_VREFLO_A(base, value) (BITBAND_ACCESS16(&ADC_CAL_REG(base), ADC_CAL_SEL_VREFLO_A_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_CAL, field SEL_VREFH_A[13] (RW)
 *
 * This bit selects the source of the VREFH reference for all conversions in
 * converter 0.
 *
 * Values:
 * - 0 - VREFH pad
 * - 1 - ANA2
 */
/*@{*/
/*! @brief Read current value of the ADC_CAL_SEL_VREFH_A field. */
#define ADC_RD_CAL_SEL_VREFH_A(base) ((ADC_CAL_REG(base) & ADC_CAL_SEL_VREFH_A_MASK) >> ADC_CAL_SEL_VREFH_A_SHIFT)
#define ADC_BRD_CAL_SEL_VREFH_A(base) (BITBAND_ACCESS16(&ADC_CAL_REG(base), ADC_CAL_SEL_VREFH_A_SHIFT))

/*! @brief Set the SEL_VREFH_A field to a new value. */
#define ADC_WR_CAL_SEL_VREFH_A(base, value) (ADC_RMW_CAL(base, ADC_CAL_SEL_VREFH_A_MASK, ADC_CAL_SEL_VREFH_A(value)))
#define ADC_BWR_CAL_SEL_VREFH_A(base, value) (BITBAND_ACCESS16(&ADC_CAL_REG(base), ADC_CAL_SEL_VREFH_A_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_CAL, field SEL_VREFLO_B[14] (RW)
 *
 * This bit selects the source of the VREFLO reference for all conversions in
 * converter 1.
 *
 * Values:
 * - 0 - VREFL pad
 * - 1 - ANB3
 */
/*@{*/
/*! @brief Read current value of the ADC_CAL_SEL_VREFLO_B field. */
#define ADC_RD_CAL_SEL_VREFLO_B(base) ((ADC_CAL_REG(base) & ADC_CAL_SEL_VREFLO_B_MASK) >> ADC_CAL_SEL_VREFLO_B_SHIFT)
#define ADC_BRD_CAL_SEL_VREFLO_B(base) (BITBAND_ACCESS16(&ADC_CAL_REG(base), ADC_CAL_SEL_VREFLO_B_SHIFT))

/*! @brief Set the SEL_VREFLO_B field to a new value. */
#define ADC_WR_CAL_SEL_VREFLO_B(base, value) (ADC_RMW_CAL(base, ADC_CAL_SEL_VREFLO_B_MASK, ADC_CAL_SEL_VREFLO_B(value)))
#define ADC_BWR_CAL_SEL_VREFLO_B(base, value) (BITBAND_ACCESS16(&ADC_CAL_REG(base), ADC_CAL_SEL_VREFLO_B_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_CAL, field SEL_VREFH_B[15] (RW)
 *
 * This bit selects the source of the VREFH reference for all conversions in
 * converter 1.
 *
 * Values:
 * - 0 - VREFH pad
 * - 1 - ANB2
 */
/*@{*/
/*! @brief Read current value of the ADC_CAL_SEL_VREFH_B field. */
#define ADC_RD_CAL_SEL_VREFH_B(base) ((ADC_CAL_REG(base) & ADC_CAL_SEL_VREFH_B_MASK) >> ADC_CAL_SEL_VREFH_B_SHIFT)
#define ADC_BRD_CAL_SEL_VREFH_B(base) (BITBAND_ACCESS16(&ADC_CAL_REG(base), ADC_CAL_SEL_VREFH_B_SHIFT))

/*! @brief Set the SEL_VREFH_B field to a new value. */
#define ADC_WR_CAL_SEL_VREFH_B(base, value) (ADC_RMW_CAL(base, ADC_CAL_SEL_VREFH_B_MASK, ADC_CAL_SEL_VREFH_B(value)))
#define ADC_BWR_CAL_SEL_VREFH_B(base, value) (BITBAND_ACCESS16(&ADC_CAL_REG(base), ADC_CAL_SEL_VREFH_B_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * ADC_GC1 - Gain Control 1 Register
 ******************************************************************************/

/*!
 * @brief ADC_GC1 - Gain Control 1 Register (RW)
 *
 * Reset value: 0x0000U
 *
 * The gain control registers are used to control amplification of each of the
 * 16 input channels. GAIN0-GAIN7 control the amplification of inputs ANA0-ANA7
 * while GAIN8-GAIN15 control the amplification of inputs ANB0-ANB7.
 */
/*!
 * @name Constants and macros for entire ADC_GC1 register
 */
/*@{*/
#define ADC_RD_GC1(base)         (ADC_GC1_REG(base))
#define ADC_WR_GC1(base, value)  (ADC_GC1_REG(base) = (value))
#define ADC_RMW_GC1(base, mask, value) (ADC_WR_GC1(base, (ADC_RD_GC1(base) & ~(mask)) | (value)))
#define ADC_SET_GC1(base, value) (ADC_WR_GC1(base, ADC_RD_GC1(base) |  (value)))
#define ADC_CLR_GC1(base, value) (ADC_WR_GC1(base, ADC_RD_GC1(base) & ~(value)))
#define ADC_TOG_GC1(base, value) (ADC_WR_GC1(base, ADC_RD_GC1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_GC1 bitfields
 */

/*!
 * @name Register ADC_GC1, field GAIN0[1:0] (RW)
 *
 * GAIN 0 controls ANA0
 *
 * Values:
 * - 00 - x1 amplification
 * - 01 - x2 amplification
 * - 10 - x4 amplification
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_GC1_GAIN0 field. */
#define ADC_RD_GC1_GAIN0(base) ((ADC_GC1_REG(base) & ADC_GC1_GAIN0_MASK) >> ADC_GC1_GAIN0_SHIFT)
#define ADC_BRD_GC1_GAIN0(base) (ADC_RD_GC1_GAIN0(base))

/*! @brief Set the GAIN0 field to a new value. */
#define ADC_WR_GC1_GAIN0(base, value) (ADC_RMW_GC1(base, ADC_GC1_GAIN0_MASK, ADC_GC1_GAIN0(value)))
#define ADC_BWR_GC1_GAIN0(base, value) (ADC_WR_GC1_GAIN0(base, value))
/*@}*/

/*!
 * @name Register ADC_GC1, field GAIN1[3:2] (RW)
 *
 * GAIN 1 controls ANA1
 *
 * Values:
 * - 00 - x1 amplification
 * - 01 - x2 amplification
 * - 10 - x4 amplification
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_GC1_GAIN1 field. */
#define ADC_RD_GC1_GAIN1(base) ((ADC_GC1_REG(base) & ADC_GC1_GAIN1_MASK) >> ADC_GC1_GAIN1_SHIFT)
#define ADC_BRD_GC1_GAIN1(base) (ADC_RD_GC1_GAIN1(base))

/*! @brief Set the GAIN1 field to a new value. */
#define ADC_WR_GC1_GAIN1(base, value) (ADC_RMW_GC1(base, ADC_GC1_GAIN1_MASK, ADC_GC1_GAIN1(value)))
#define ADC_BWR_GC1_GAIN1(base, value) (ADC_WR_GC1_GAIN1(base, value))
/*@}*/

/*!
 * @name Register ADC_GC1, field GAIN2[5:4] (RW)
 *
 * GAIN 2 controls ANA2
 *
 * Values:
 * - 00 - x1 amplification
 * - 01 - x2 amplification
 * - 10 - x4 amplification
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_GC1_GAIN2 field. */
#define ADC_RD_GC1_GAIN2(base) ((ADC_GC1_REG(base) & ADC_GC1_GAIN2_MASK) >> ADC_GC1_GAIN2_SHIFT)
#define ADC_BRD_GC1_GAIN2(base) (ADC_RD_GC1_GAIN2(base))

/*! @brief Set the GAIN2 field to a new value. */
#define ADC_WR_GC1_GAIN2(base, value) (ADC_RMW_GC1(base, ADC_GC1_GAIN2_MASK, ADC_GC1_GAIN2(value)))
#define ADC_BWR_GC1_GAIN2(base, value) (ADC_WR_GC1_GAIN2(base, value))
/*@}*/

/*!
 * @name Register ADC_GC1, field GAIN3[7:6] (RW)
 *
 * GAIN 3 controls ANA3
 *
 * Values:
 * - 00 - x1 amplification
 * - 01 - x2 amplification
 * - 10 - x4 amplification
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_GC1_GAIN3 field. */
#define ADC_RD_GC1_GAIN3(base) ((ADC_GC1_REG(base) & ADC_GC1_GAIN3_MASK) >> ADC_GC1_GAIN3_SHIFT)
#define ADC_BRD_GC1_GAIN3(base) (ADC_RD_GC1_GAIN3(base))

/*! @brief Set the GAIN3 field to a new value. */
#define ADC_WR_GC1_GAIN3(base, value) (ADC_RMW_GC1(base, ADC_GC1_GAIN3_MASK, ADC_GC1_GAIN3(value)))
#define ADC_BWR_GC1_GAIN3(base, value) (ADC_WR_GC1_GAIN3(base, value))
/*@}*/

/*!
 * @name Register ADC_GC1, field GAIN4[9:8] (RW)
 *
 * GAIN 4 controls ANA4
 *
 * Values:
 * - 00 - x1 amplification
 * - 01 - x2 amplification
 * - 10 - x4 amplification
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_GC1_GAIN4 field. */
#define ADC_RD_GC1_GAIN4(base) ((ADC_GC1_REG(base) & ADC_GC1_GAIN4_MASK) >> ADC_GC1_GAIN4_SHIFT)
#define ADC_BRD_GC1_GAIN4(base) (ADC_RD_GC1_GAIN4(base))

/*! @brief Set the GAIN4 field to a new value. */
#define ADC_WR_GC1_GAIN4(base, value) (ADC_RMW_GC1(base, ADC_GC1_GAIN4_MASK, ADC_GC1_GAIN4(value)))
#define ADC_BWR_GC1_GAIN4(base, value) (ADC_WR_GC1_GAIN4(base, value))
/*@}*/

/*!
 * @name Register ADC_GC1, field GAIN5[11:10] (RW)
 *
 * GAIN 5 controls ANA5
 *
 * Values:
 * - 00 - x1 amplification
 * - 01 - x2 amplification
 * - 10 - x4 amplification
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_GC1_GAIN5 field. */
#define ADC_RD_GC1_GAIN5(base) ((ADC_GC1_REG(base) & ADC_GC1_GAIN5_MASK) >> ADC_GC1_GAIN5_SHIFT)
#define ADC_BRD_GC1_GAIN5(base) (ADC_RD_GC1_GAIN5(base))

