theatrus/ksdk/platform/devices/MKV43F15/include/MKV43F15_extension.h
/*! @brief Set the GAIN5 field to a new value. */
#define ADC_WR_GC1_GAIN5(base, value) (ADC_RMW_GC1(base, ADC_GC1_GAIN5_MASK, ADC_GC1_GAIN5(value)))
#define ADC_BWR_GC1_GAIN5(base, value) (ADC_WR_GC1_GAIN5(base, value))
/*@}*/

/*!
 * @name Register ADC_GC1, field GAIN6[13:12] (RW)
 *
 * GAIN 6 controls ANA6
 *
 * Values:
 * - 00 - x1 amplification
 * - 01 - x2 amplification
 * - 10 - x4 amplification
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_GC1_GAIN6 field. */
#define ADC_RD_GC1_GAIN6(base) ((ADC_GC1_REG(base) & ADC_GC1_GAIN6_MASK) >> ADC_GC1_GAIN6_SHIFT)
#define ADC_BRD_GC1_GAIN6(base) (ADC_RD_GC1_GAIN6(base))

/*! @brief Set the GAIN6 field to a new value. */
#define ADC_WR_GC1_GAIN6(base, value) (ADC_RMW_GC1(base, ADC_GC1_GAIN6_MASK, ADC_GC1_GAIN6(value)))
#define ADC_BWR_GC1_GAIN6(base, value) (ADC_WR_GC1_GAIN6(base, value))
/*@}*/

/*!
 * @name Register ADC_GC1, field GAIN7[15:14] (RW)
 *
 * GAIN 7 controls ANA7
 *
 * Values:
 * - 00 - x1 amplification
 * - 01 - x2 amplification
 * - 10 - x4 amplification
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_GC1_GAIN7 field. */
#define ADC_RD_GC1_GAIN7(base) ((ADC_GC1_REG(base) & ADC_GC1_GAIN7_MASK) >> ADC_GC1_GAIN7_SHIFT)
#define ADC_BRD_GC1_GAIN7(base) (ADC_RD_GC1_GAIN7(base))

/*! @brief Set the GAIN7 field to a new value. */
#define ADC_WR_GC1_GAIN7(base, value) (ADC_RMW_GC1(base, ADC_GC1_GAIN7_MASK, ADC_GC1_GAIN7(value)))
#define ADC_BWR_GC1_GAIN7(base, value) (ADC_WR_GC1_GAIN7(base, value))
/*@}*/

/*******************************************************************************
 * ADC_GC2 - Gain Control 2 Register
 ******************************************************************************/

/*!
 * @brief ADC_GC2 - Gain Control 2 Register (RW)
 *
 * Reset value: 0x0000U
 *
 * The gain control registers are used to control amplification of each of the
 * 16 input channels. GAIN0-GAIN7 control the amplification of inputs ANA0-ANA7
 * while GAIN8-GAIN15 control the amplification of inputs ANB0-ANB7.
 */
/*!
 * @name Constants and macros for entire ADC_GC2 register
 */
/*@{*/
#define ADC_RD_GC2(base)         (ADC_GC2_REG(base))
#define ADC_WR_GC2(base, value)  (ADC_GC2_REG(base) = (value))
#define ADC_RMW_GC2(base, mask, value) (ADC_WR_GC2(base, (ADC_RD_GC2(base) & ~(mask)) | (value)))
#define ADC_SET_GC2(base, value) (ADC_WR_GC2(base, ADC_RD_GC2(base) |  (value)))
#define ADC_CLR_GC2(base, value) (ADC_WR_GC2(base, ADC_RD_GC2(base) & ~(value)))
#define ADC_TOG_GC2(base, value) (ADC_WR_GC2(base, ADC_RD_GC2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_GC2 bitfields
 */

/*!
 * @name Register ADC_GC2, field GAIN8[1:0] (RW)
 *
 * GAIN 8 controls ANB0
 *
 * Values:
 * - 00 - x1 amplification
 * - 01 - x2 amplification
 * - 10 - x4 amplification
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_GC2_GAIN8 field. */
#define ADC_RD_GC2_GAIN8(base) ((ADC_GC2_REG(base) & ADC_GC2_GAIN8_MASK) >> ADC_GC2_GAIN8_SHIFT)
#define ADC_BRD_GC2_GAIN8(base) (ADC_RD_GC2_GAIN8(base))

/*! @brief Set the GAIN8 field to a new value. */
#define ADC_WR_GC2_GAIN8(base, value) (ADC_RMW_GC2(base, ADC_GC2_GAIN8_MASK, ADC_GC2_GAIN8(value)))
#define ADC_BWR_GC2_GAIN8(base, value) (ADC_WR_GC2_GAIN8(base, value))
/*@}*/

/*!
 * @name Register ADC_GC2, field GAIN9[3:2] (RW)
 *
 * GAIN 9 controls ANB1
 *
 * Values:
 * - 00 - x1 amplification
 * - 01 - x2 amplification
 * - 10 - x4 amplification
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_GC2_GAIN9 field. */
#define ADC_RD_GC2_GAIN9(base) ((ADC_GC2_REG(base) & ADC_GC2_GAIN9_MASK) >> ADC_GC2_GAIN9_SHIFT)
#define ADC_BRD_GC2_GAIN9(base) (ADC_RD_GC2_GAIN9(base))

/*! @brief Set the GAIN9 field to a new value. */
#define ADC_WR_GC2_GAIN9(base, value) (ADC_RMW_GC2(base, ADC_GC2_GAIN9_MASK, ADC_GC2_GAIN9(value)))
#define ADC_BWR_GC2_GAIN9(base, value) (ADC_WR_GC2_GAIN9(base, value))
/*@}*/

/*!
 * @name Register ADC_GC2, field GAIN10[5:4] (RW)
 *
 * GAIN 10 controls ANB2
 *
 * Values:
 * - 00 - x1 amplification
 * - 01 - x2 amplification
 * - 10 - x4 amplification
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_GC2_GAIN10 field. */
#define ADC_RD_GC2_GAIN10(base) ((ADC_GC2_REG(base) & ADC_GC2_GAIN10_MASK) >> ADC_GC2_GAIN10_SHIFT)
#define ADC_BRD_GC2_GAIN10(base) (ADC_RD_GC2_GAIN10(base))

/*! @brief Set the GAIN10 field to a new value. */
#define ADC_WR_GC2_GAIN10(base, value) (ADC_RMW_GC2(base, ADC_GC2_GAIN10_MASK, ADC_GC2_GAIN10(value)))
#define ADC_BWR_GC2_GAIN10(base, value) (ADC_WR_GC2_GAIN10(base, value))
/*@}*/

/*!
 * @name Register ADC_GC2, field GAIN11[7:6] (RW)
 *
 * GAIN 11 controls ANB3
 *
 * Values:
 * - 00 - x1 amplification
 * - 01 - x2 amplification
 * - 10 - x4 amplification
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_GC2_GAIN11 field. */
#define ADC_RD_GC2_GAIN11(base) ((ADC_GC2_REG(base) & ADC_GC2_GAIN11_MASK) >> ADC_GC2_GAIN11_SHIFT)
#define ADC_BRD_GC2_GAIN11(base) (ADC_RD_GC2_GAIN11(base))

/*! @brief Set the GAIN11 field to a new value. */
#define ADC_WR_GC2_GAIN11(base, value) (ADC_RMW_GC2(base, ADC_GC2_GAIN11_MASK, ADC_GC2_GAIN11(value)))
#define ADC_BWR_GC2_GAIN11(base, value) (ADC_WR_GC2_GAIN11(base, value))
/*@}*/

/*!
 * @name Register ADC_GC2, field GAIN12[9:8] (RW)
 *
 * GAIN 12 controls ANB4
 *
 * Values:
 * - 00 - x1 amplification
 * - 01 - x2 amplification
 * - 10 - x4 amplification
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_GC2_GAIN12 field. */
#define ADC_RD_GC2_GAIN12(base) ((ADC_GC2_REG(base) & ADC_GC2_GAIN12_MASK) >> ADC_GC2_GAIN12_SHIFT)
#define ADC_BRD_GC2_GAIN12(base) (ADC_RD_GC2_GAIN12(base))

/*! @brief Set the GAIN12 field to a new value. */
#define ADC_WR_GC2_GAIN12(base, value) (ADC_RMW_GC2(base, ADC_GC2_GAIN12_MASK, ADC_GC2_GAIN12(value)))
#define ADC_BWR_GC2_GAIN12(base, value) (ADC_WR_GC2_GAIN12(base, value))
/*@}*/

/*!
 * @name Register ADC_GC2, field GAIN13[11:10] (RW)
 *
 * GAIN 13 controls ANB5
 *
 * Values:
 * - 00 - x1 amplification
 * - 01 - x2 amplification
 * - 10 - x4 amplification
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_GC2_GAIN13 field. */
#define ADC_RD_GC2_GAIN13(base) ((ADC_GC2_REG(base) & ADC_GC2_GAIN13_MASK) >> ADC_GC2_GAIN13_SHIFT)
#define ADC_BRD_GC2_GAIN13(base) (ADC_RD_GC2_GAIN13(base))

/*! @brief Set the GAIN13 field to a new value. */
#define ADC_WR_GC2_GAIN13(base, value) (ADC_RMW_GC2(base, ADC_GC2_GAIN13_MASK, ADC_GC2_GAIN13(value)))
#define ADC_BWR_GC2_GAIN13(base, value) (ADC_WR_GC2_GAIN13(base, value))
/*@}*/

/*!
 * @name Register ADC_GC2, field GAIN14[13:12] (RW)
 *
 * GAIN 14 controls ANB6
 *
 * Values:
 * - 00 - x1 amplification
 * - 01 - x2 amplification
 * - 10 - x4 amplification
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_GC2_GAIN14 field. */
#define ADC_RD_GC2_GAIN14(base) ((ADC_GC2_REG(base) & ADC_GC2_GAIN14_MASK) >> ADC_GC2_GAIN14_SHIFT)
#define ADC_BRD_GC2_GAIN14(base) (ADC_RD_GC2_GAIN14(base))

