theatrus/ksdk/platform/devices/MKV43F15/include/MKV43F15_extension.h
/*
 * MKV43F15 AOI
 *
 * AND/OR/INVERT module
 *
 * Registers defined in this header file:
 * - AOI_BFCRT01 - Boolean Function Term 0 and 1 Configuration Register for EVENTn
 * - AOI_BFCRT23 - Boolean Function Term 2 and 3 Configuration Register for EVENTn
 */

#define AOI_INSTANCE_COUNT (1U) /*!< Number of instances of the AOI module. */
#define AOI_IDX (0U) /*!< Instance number for AOI. */

/*******************************************************************************
 * AOI_BFCRT01 - Boolean Function Term 0 and 1 Configuration Register for EVENTn
 ******************************************************************************/

/*!
 * @brief AOI_BFCRT01 - Boolean Function Term 0 and 1 Configuration Register for EVENTn (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire AOI_BFCRT01 register
 */
/*@{*/
#define AOI_RD_BFCRT01(base, index) (AOI_BFCRT01_REG(base, index))
#define AOI_WR_BFCRT01(base, index, value) (AOI_BFCRT01_REG(base, index) = (value))
#define AOI_RMW_BFCRT01(base, index, mask, value) (AOI_WR_BFCRT01(base, index, (AOI_RD_BFCRT01(base, index) & ~(mask)) | (value)))
#define AOI_SET_BFCRT01(base, index, value) (AOI_WR_BFCRT01(base, index, AOI_RD_BFCRT01(base, index) |  (value)))
#define AOI_CLR_BFCRT01(base, index, value) (AOI_WR_BFCRT01(base, index, AOI_RD_BFCRT01(base, index) & ~(value)))
#define AOI_TOG_BFCRT01(base, index, value) (AOI_WR_BFCRT01(base, index, AOI_RD_BFCRT01(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual AOI_BFCRT01 bitfields
 */

/*!
 * @name Register AOI_BFCRT01, field PT1_DC[1:0] (RW)
 *
 * This 2-bit field defines the Boolean evaluation associated with the selected
 * input D in product term 1.
 *
 * Values:
 * - 00 - Force the D input in this product term to a logical zero
 * - 01 - Pass the D input in this product term
 * - 10 - Complement the D input in this product term
 * - 11 - Force the D input in this product term to a logical one
 */
/*@{*/
/*! @brief Read current value of the AOI_BFCRT01_PT1_DC field. */
#define AOI_RD_BFCRT01_PT1_DC(base, index) ((AOI_BFCRT01_REG(base, index) & AOI_BFCRT01_PT1_DC_MASK) >> AOI_BFCRT01_PT1_DC_SHIFT)
#define AOI_BRD_BFCRT01_PT1_DC(base, index) (AOI_RD_BFCRT01_PT1_DC(base, index))

/*! @brief Set the PT1_DC field to a new value. */
#define AOI_WR_BFCRT01_PT1_DC(base, index, value) (AOI_RMW_BFCRT01(base, index, AOI_BFCRT01_PT1_DC_MASK, AOI_BFCRT01_PT1_DC(value)))
#define AOI_BWR_BFCRT01_PT1_DC(base, index, value) (AOI_WR_BFCRT01_PT1_DC(base, index, value))
/*@}*/

/*!
 * @name Register AOI_BFCRT01, field PT1_CC[3:2] (RW)
 *
 * This 2-bit field defines the Boolean evaluation associated with the selected
 * input C in product term 1.
 *
 * Values:
 * - 00 - Force the C input in this product term to a logical zero
 * - 01 - Pass the C input in this product term
 * - 10 - Complement the C input in this product term
 * - 11 - Force the C input in this product term to a logical one
 */
/*@{*/
/*! @brief Read current value of the AOI_BFCRT01_PT1_CC field. */
#define AOI_RD_BFCRT01_PT1_CC(base, index) ((AOI_BFCRT01_REG(base, index) & AOI_BFCRT01_PT1_CC_MASK) >> AOI_BFCRT01_PT1_CC_SHIFT)
#define AOI_BRD_BFCRT01_PT1_CC(base, index) (AOI_RD_BFCRT01_PT1_CC(base, index))

/*! @brief Set the PT1_CC field to a new value. */
#define AOI_WR_BFCRT01_PT1_CC(base, index, value) (AOI_RMW_BFCRT01(base, index, AOI_BFCRT01_PT1_CC_MASK, AOI_BFCRT01_PT1_CC(value)))
#define AOI_BWR_BFCRT01_PT1_CC(base, index, value) (AOI_WR_BFCRT01_PT1_CC(base, index, value))
/*@}*/

/*!
 * @name Register AOI_BFCRT01, field PT1_BC[5:4] (RW)
 *
 * This 2-bit field defines the Boolean evaluation associated with the selected
 * input B in product term 1.
 *
 * Values:
 * - 00 - Force the B input in this product term to a logical zero
 * - 01 - Pass the B input in this product term
 * - 10 - Complement the B input in this product term
 * - 11 - Force the B input in this product term to a logical one
 */
/*@{*/
/*! @brief Read current value of the AOI_BFCRT01_PT1_BC field. */
#define AOI_RD_BFCRT01_PT1_BC(base, index) ((AOI_BFCRT01_REG(base, index) & AOI_BFCRT01_PT1_BC_MASK) >> AOI_BFCRT01_PT1_BC_SHIFT)
#define AOI_BRD_BFCRT01_PT1_BC(base, index) (AOI_RD_BFCRT01_PT1_BC(base, index))

/*! @brief Set the PT1_BC field to a new value. */
#define AOI_WR_BFCRT01_PT1_BC(base, index, value) (AOI_RMW_BFCRT01(base, index, AOI_BFCRT01_PT1_BC_MASK, AOI_BFCRT01_PT1_BC(value)))
#define AOI_BWR_BFCRT01_PT1_BC(base, index, value) (AOI_WR_BFCRT01_PT1_BC(base, index, value))
/*@}*/

/*!
 * @name Register AOI_BFCRT01, field PT1_AC[7:6] (RW)
 *
 * This 2-bit field defines the Boolean evaluation associated with the selected
 * input A in product term 1.
 *
 * Values:
 * - 00 - Force the A input in this product term to a logical zero
 * - 01 - Pass the A input in this product term
 * - 10 - Complement the A input in this product term
 * - 11 - Force the A input in this product term to a logical one
 */
/*@{*/
/*! @brief Read current value of the AOI_BFCRT01_PT1_AC field. */
#define AOI_RD_BFCRT01_PT1_AC(base, index) ((AOI_BFCRT01_REG(base, index) & AOI_BFCRT01_PT1_AC_MASK) >> AOI_BFCRT01_PT1_AC_SHIFT)
#define AOI_BRD_BFCRT01_PT1_AC(base, index) (AOI_RD_BFCRT01_PT1_AC(base, index))

/*! @brief Set the PT1_AC field to a new value. */
#define AOI_WR_BFCRT01_PT1_AC(base, index, value) (AOI_RMW_BFCRT01(base, index, AOI_BFCRT01_PT1_AC_MASK, AOI_BFCRT01_PT1_AC(value)))
#define AOI_BWR_BFCRT01_PT1_AC(base, index, value) (AOI_WR_BFCRT01_PT1_AC(base, index, value))
/*@}*/

/*!
 * @name Register AOI_BFCRT01, field PT0_DC[9:8] (RW)
 *
 * This 2-bit field defines the Boolean evaluation associated with the selected
 * input D in product term 0.
 *
 * Values:
 * - 00 - Force the D input in this product term to a logical zero
 * - 01 - Pass the D input in this product term
 * - 10 - Complement the D input in this product term
 * - 11 - Force the D input in this product term to a logical one
 */
/*@{*/
/*! @brief Read current value of the AOI_BFCRT01_PT0_DC field. */
#define AOI_RD_BFCRT01_PT0_DC(base, index) ((AOI_BFCRT01_REG(base, index) & AOI_BFCRT01_PT0_DC_MASK) >> AOI_BFCRT01_PT0_DC_SHIFT)
#define AOI_BRD_BFCRT01_PT0_DC(base, index) (AOI_RD_BFCRT01_PT0_DC(base, index))

/*! @brief Set the PT0_DC field to a new value. */
#define AOI_WR_BFCRT01_PT0_DC(base, index, value) (AOI_RMW_BFCRT01(base, index, AOI_BFCRT01_PT0_DC_MASK, AOI_BFCRT01_PT0_DC(value)))
#define AOI_BWR_BFCRT01_PT0_DC(base, index, value) (AOI_WR_BFCRT01_PT0_DC(base, index, value))
/*@}*/

/*!
 * @name Register AOI_BFCRT01, field PT0_CC[11:10] (RW)
 *
 * This 2-bit field defines the Boolean evaluation associated with the selected
 * input C in product term 0.
 *
 * Values:
 * - 00 - Force the C input in this product term to a logical zero
 * - 01 - Pass the C input in this product term
 * - 10 - Complement the C input in this product term
 * - 11 - Force the C input in this product term to a logical one
 */
/*@{*/
/*! @brief Read current value of the AOI_BFCRT01_PT0_CC field. */
#define AOI_RD_BFCRT01_PT0_CC(base, index) ((AOI_BFCRT01_REG(base, index) & AOI_BFCRT01_PT0_CC_MASK) >> AOI_BFCRT01_PT0_CC_SHIFT)
#define AOI_BRD_BFCRT01_PT0_CC(base, index) (AOI_RD_BFCRT01_PT0_CC(base, index))

/*! @brief Set the PT0_CC field to a new value. */
#define AOI_WR_BFCRT01_PT0_CC(base, index, value) (AOI_RMW_BFCRT01(base, index, AOI_BFCRT01_PT0_CC_MASK, AOI_BFCRT01_PT0_CC(value)))
#define AOI_BWR_BFCRT01_PT0_CC(base, index, value) (AOI_WR_BFCRT01_PT0_CC(base, index, value))
/*@}*/

/*!
 * @name Register AOI_BFCRT01, field PT0_BC[13:12] (RW)
 *
 * This 2-bit field defines the Boolean evaluation associated with the selected
 * input B in product term 0.
 *
 * Values:
 * - 00 - Force the B input in this product term to a logical zero
 * - 01 - Pass the B input in this product term
 * - 10 - Complement the B input in this product term
 * - 11 - Force the B input in this product term to a logical one
 */
/*@{*/
/*! @brief Read current value of the AOI_BFCRT01_PT0_BC field. */
#define AOI_RD_BFCRT01_PT0_BC(base, index) ((AOI_BFCRT01_REG(base, index) & AOI_BFCRT01_PT0_BC_MASK) >> AOI_BFCRT01_PT0_BC_SHIFT)
#define AOI_BRD_BFCRT01_PT0_BC(base, index) (AOI_RD_BFCRT01_PT0_BC(base, index))

/*! @brief Set the PT0_BC field to a new value. */
#define AOI_WR_BFCRT01_PT0_BC(base, index, value) (AOI_RMW_BFCRT01(base, index, AOI_BFCRT01_PT0_BC_MASK, AOI_BFCRT01_PT0_BC(value)))
#define AOI_BWR_BFCRT01_PT0_BC(base, index, value) (AOI_WR_BFCRT01_PT0_BC(base, index, value))
/*@}*/

/*!
 * @name Register AOI_BFCRT01, field PT0_AC[15:14] (RW)
 *
 * This 2-bit field defines the Boolean evaluation associated with the selected
 * input A in product term 0.
 *
 * Values:
 * - 00 - Force the A input in this product term to a logical zero
 * - 01 - Pass the A input in this product term
 * - 10 - Complement the A input in this product term
 * - 11 - Force the A input in this product term to a logical one
 */
/*@{*/
/*! @brief Read current value of the AOI_BFCRT01_PT0_AC field. */
#define AOI_RD_BFCRT01_PT0_AC(base, index) ((AOI_BFCRT01_REG(base, index) & AOI_BFCRT01_PT0_AC_MASK) >> AOI_BFCRT01_PT0_AC_SHIFT)
#define AOI_BRD_BFCRT01_PT0_AC(base, index) (AOI_RD_BFCRT01_PT0_AC(base, index))

/*! @brief Set the PT0_AC field to a new value. */
#define AOI_WR_BFCRT01_PT0_AC(base, index, value) (AOI_RMW_BFCRT01(base, index, AOI_BFCRT01_PT0_AC_MASK, AOI_BFCRT01_PT0_AC(value)))
#define AOI_BWR_BFCRT01_PT0_AC(base, index, value) (AOI_WR_BFCRT01_PT0_AC(base, index, value))
/*@}*/

