theatrus/ksdk/platform/devices/MKV43F15/include/MKV43F15_extension.h
/*******************************************************************************
 * PWM_VAL2 - Value Register 2
 ******************************************************************************/

/*!
 * @brief PWM_VAL2 - Value Register 2 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_VAL2 register
 */
/*@{*/
#define PWM_RD_VAL2(base, index) (PWM_VAL2_REG(base, index))
#define PWM_WR_VAL2(base, index, value) (PWM_VAL2_REG(base, index) = (value))
#define PWM_RMW_VAL2(base, index, mask, value) (PWM_WR_VAL2(base, index, (PWM_RD_VAL2(base, index) & ~(mask)) | (value)))
#define PWM_SET_VAL2(base, index, value) (PWM_WR_VAL2(base, index, PWM_RD_VAL2(base, index) |  (value)))
#define PWM_CLR_VAL2(base, index, value) (PWM_WR_VAL2(base, index, PWM_RD_VAL2(base, index) & ~(value)))
#define PWM_TOG_VAL2(base, index, value) (PWM_WR_VAL2(base, index, PWM_RD_VAL2(base, index) ^  (value)))
/*@}*/

/*******************************************************************************
 * PWM_FRACVAL3 - Fractional Value Register 3
 ******************************************************************************/

/*!
 * @brief PWM_FRACVAL3 - Fractional Value Register 3 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_FRACVAL3 register
 */
/*@{*/
#define PWM_RD_FRACVAL3(base, index) (PWM_FRACVAL3_REG(base, index))
#define PWM_WR_FRACVAL3(base, index, value) (PWM_FRACVAL3_REG(base, index) = (value))
#define PWM_RMW_FRACVAL3(base, index, mask, value) (PWM_WR_FRACVAL3(base, index, (PWM_RD_FRACVAL3(base, index) & ~(mask)) | (value)))
#define PWM_SET_FRACVAL3(base, index, value) (PWM_WR_FRACVAL3(base, index, PWM_RD_FRACVAL3(base, index) |  (value)))
#define PWM_CLR_FRACVAL3(base, index, value) (PWM_WR_FRACVAL3(base, index, PWM_RD_FRACVAL3(base, index) & ~(value)))
#define PWM_TOG_FRACVAL3(base, index, value) (PWM_WR_FRACVAL3(base, index, PWM_RD_FRACVAL3(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_FRACVAL3 bitfields
 */

/*!
 * @name Register PWM_FRACVAL3, field FRACVAL3[15:11] (RW)
 *
 * These bits act as a fractional addition to the value in the VAL3 register
 * which controls the PWM_A turn off timing. It is also used to control the
 * fractional addition to the turn on delay of PWM_B when MCTRL[IPOLx]=0 in complementary
 * mode, CTRL2[INDEP]=0. The FRACVAL3 register is buffered. The value written
 * does not take effect until MCTRL[LDOK] is set and the next PWM load cycle begins
 * or CTRL[LDMOD] is set. FRACVAL3 cannot be written when MCTRL[LDOK] is set.
 * Reading FRACVAL3 reads the value in a buffer and not necessarily the value the
 * PWM generator is currently using. FRCTRL[FRAC23_EN] should be set to 0 when the
 * values of VAL2 and VAL3 cause the high or low time of the PWM output to be 3
 * cycles or less.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRACVAL3_FRACVAL3 field. */
#define PWM_RD_FRACVAL3_FRACVAL3(base, index) ((PWM_FRACVAL3_REG(base, index) & PWM_FRACVAL3_FRACVAL3_MASK) >> PWM_FRACVAL3_FRACVAL3_SHIFT)
#define PWM_BRD_FRACVAL3_FRACVAL3(base, index) (PWM_RD_FRACVAL3_FRACVAL3(base, index))

/*! @brief Set the FRACVAL3 field to a new value. */
#define PWM_WR_FRACVAL3_FRACVAL3(base, index, value) (PWM_RMW_FRACVAL3(base, index, PWM_FRACVAL3_FRACVAL3_MASK, PWM_FRACVAL3_FRACVAL3(value)))
#define PWM_BWR_FRACVAL3_FRACVAL3(base, index, value) (PWM_WR_FRACVAL3_FRACVAL3(base, index, value))
/*@}*/

/*******************************************************************************
 * PWM_VAL3 - Value Register 3
 ******************************************************************************/

/*!
 * @brief PWM_VAL3 - Value Register 3 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_VAL3 register
 */
/*@{*/
#define PWM_RD_VAL3(base, index) (PWM_VAL3_REG(base, index))
#define PWM_WR_VAL3(base, index, value) (PWM_VAL3_REG(base, index) = (value))
#define PWM_RMW_VAL3(base, index, mask, value) (PWM_WR_VAL3(base, index, (PWM_RD_VAL3(base, index) & ~(mask)) | (value)))
#define PWM_SET_VAL3(base, index, value) (PWM_WR_VAL3(base, index, PWM_RD_VAL3(base, index) |  (value)))
#define PWM_CLR_VAL3(base, index, value) (PWM_WR_VAL3(base, index, PWM_RD_VAL3(base, index) & ~(value)))
#define PWM_TOG_VAL3(base, index, value) (PWM_WR_VAL3(base, index, PWM_RD_VAL3(base, index) ^  (value)))
/*@}*/

/*******************************************************************************
 * PWM_FRACVAL4 - Fractional Value Register 4
 ******************************************************************************/

/*!
 * @brief PWM_FRACVAL4 - Fractional Value Register 4 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_FRACVAL4 register
 */
/*@{*/
#define PWM_RD_FRACVAL4(base, index) (PWM_FRACVAL4_REG(base, index))
#define PWM_WR_FRACVAL4(base, index, value) (PWM_FRACVAL4_REG(base, index) = (value))
#define PWM_RMW_FRACVAL4(base, index, mask, value) (PWM_WR_FRACVAL4(base, index, (PWM_RD_FRACVAL4(base, index) & ~(mask)) | (value)))
#define PWM_SET_FRACVAL4(base, index, value) (PWM_WR_FRACVAL4(base, index, PWM_RD_FRACVAL4(base, index) |  (value)))
#define PWM_CLR_FRACVAL4(base, index, value) (PWM_WR_FRACVAL4(base, index, PWM_RD_FRACVAL4(base, index) & ~(value)))
#define PWM_TOG_FRACVAL4(base, index, value) (PWM_WR_FRACVAL4(base, index, PWM_RD_FRACVAL4(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_FRACVAL4 bitfields
 */

/*!
 * @name Register PWM_FRACVAL4, field FRACVAL4[15:11] (RW)
 *
 * These bits act as a fractional addition to the value in the VAL4 register
 * which controls the PWM_B turn on timing. It is also used to control the
 * fractional addition to the turn off delay of PWM_A when MCTRL[IPOLx]=1 in complementary
 * mode, CTRL2[INDEP]=0. The FRACVAL4 register is buffered. The value written
 * does not take effect until MCTRL[LDOK] is set and the next PWM load cycle begins
 * or CTRL[LDMOD] is set. FRACVAL4 cannot be written when MCTRL[LDOK] is set.
 * Reading FRACVAL4 reads the value in a buffer and not necessarily the value the
 * PWM generator is currently using. FRCTRL[FRAC45_EN] should be set to 0 when the
 * values of VAL4 and VAL5 cause the high or low time of the PWM output to be 3
 * cycles or less.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRACVAL4_FRACVAL4 field. */
#define PWM_RD_FRACVAL4_FRACVAL4(base, index) ((PWM_FRACVAL4_REG(base, index) & PWM_FRACVAL4_FRACVAL4_MASK) >> PWM_FRACVAL4_FRACVAL4_SHIFT)
#define PWM_BRD_FRACVAL4_FRACVAL4(base, index) (PWM_RD_FRACVAL4_FRACVAL4(base, index))

