theatrus/ksdk/platform/devices/MKV43F15/include/MKV43F15_extension.h
/*
 * Constants & macros for individual PWM_DISMAP bitfields
 */

/*!
 * @name Register PWM_DISMAP, field DIS0A[3:0] (RW)
 *
 * Each of the four bits of this read/write field is one-to-one associated with
 * the four FAULTx inputs of fault channel 0. The PWM_A output is turned off if
 * there is a logic 1 on a FAULTx input and a 1 in the corresponding bit of this
 * field. A reset sets all bits in this field.
 */
/*@{*/
/*! @brief Read current value of the PWM_DISMAP_DIS0A field. */
#define PWM_RD_DISMAP_DIS0A(base, index, index2) ((PWM_DISMAP_REG(base, index, index2) & PWM_DISMAP_DIS0A_MASK) >> PWM_DISMAP_DIS0A_SHIFT)
#define PWM_BRD_DISMAP_DIS0A(base, index, index2) (PWM_RD_DISMAP_DIS0A(base, index, index2))

/*! @brief Set the DIS0A field to a new value. */
#define PWM_WR_DISMAP_DIS0A(base, index, index2, value) (PWM_RMW_DISMAP(base, index, index2, PWM_DISMAP_DIS0A_MASK, PWM_DISMAP_DIS0A(value)))
#define PWM_BWR_DISMAP_DIS0A(base, index, index2, value) (PWM_WR_DISMAP_DIS0A(base, index, index2, value))
/*@}*/

/*!
 * @name Register PWM_DISMAP, field DIS0B[7:4] (RW)
 *
 * Each of the four bits of this read/write field is one-to-one associated with
 * the four FAULTx inputs of fault channel 0. The PWM_B output is turned off if
 * there is a logic 1 on a FAULTx input and a 1 in the corresponding bit of this
 * field. A reset sets all bits in this field.
 */
/*@{*/
/*! @brief Read current value of the PWM_DISMAP_DIS0B field. */
#define PWM_RD_DISMAP_DIS0B(base, index, index2) ((PWM_DISMAP_REG(base, index, index2) & PWM_DISMAP_DIS0B_MASK) >> PWM_DISMAP_DIS0B_SHIFT)
#define PWM_BRD_DISMAP_DIS0B(base, index, index2) (PWM_RD_DISMAP_DIS0B(base, index, index2))

/*! @brief Set the DIS0B field to a new value. */
#define PWM_WR_DISMAP_DIS0B(base, index, index2, value) (PWM_RMW_DISMAP(base, index, index2, PWM_DISMAP_DIS0B_MASK, PWM_DISMAP_DIS0B(value)))
#define PWM_BWR_DISMAP_DIS0B(base, index, index2, value) (PWM_WR_DISMAP_DIS0B(base, index, index2, value))
/*@}*/

/*!
 * @name Register PWM_DISMAP, field DIS0X[11:8] (RW)
 *
 * Each of the four bits of this read/write field is one-to-one associated with
 * the four FAULTx inputs of fault channel 0. The PWM_X output is turned off if
 * there is a logic 1 on a FAULTx input and a 1 in the corresponding bit of this
 * field. A reset sets all bits in this field.
 */
/*@{*/
/*! @brief Read current value of the PWM_DISMAP_DIS0X field. */
#define PWM_RD_DISMAP_DIS0X(base, index, index2) ((PWM_DISMAP_REG(base, index, index2) & PWM_DISMAP_DIS0X_MASK) >> PWM_DISMAP_DIS0X_SHIFT)
#define PWM_BRD_DISMAP_DIS0X(base, index, index2) (PWM_RD_DISMAP_DIS0X(base, index, index2))

/*! @brief Set the DIS0X field to a new value. */
#define PWM_WR_DISMAP_DIS0X(base, index, index2, value) (PWM_RMW_DISMAP(base, index, index2, PWM_DISMAP_DIS0X_MASK, PWM_DISMAP_DIS0X(value)))
#define PWM_BWR_DISMAP_DIS0X(base, index, index2, value) (PWM_WR_DISMAP_DIS0X(base, index, index2, value))
/*@}*/

/*******************************************************************************
 * PWM_DTCNT0 - Deadtime Count Register 0
 ******************************************************************************/

/*!
 * @brief PWM_DTCNT0 - Deadtime Count Register 0 (RW)
 *
 * Reset value: 0x07FFU
 *
 * Deadtime operation applies only to complementary channel operation. The
 * values written to the DTCNTx registers are in terms of IPBus clock cycles
 * regardless of the setting of CTRL[PRSC] and/or CTRL2[CLK_SEL]. Reset sets the deadtime
 * count registers to a default value of 0x07FF, selecting a deadtime of 2047
 * IPBus clock cycles. The DTCNTx registers are not byte accessible.
 */
/*!
 * @name Constants and macros for entire PWM_DTCNT0 register
 */
/*@{*/
#define PWM_RD_DTCNT0(base, index) (PWM_DTCNT0_REG(base, index))
#define PWM_WR_DTCNT0(base, index, value) (PWM_DTCNT0_REG(base, index) = (value))
#define PWM_RMW_DTCNT0(base, index, mask, value) (PWM_WR_DTCNT0(base, index, (PWM_RD_DTCNT0(base, index) & ~(mask)) | (value)))
#define PWM_SET_DTCNT0(base, index, value) (PWM_WR_DTCNT0(base, index, PWM_RD_DTCNT0(base, index) |  (value)))
#define PWM_CLR_DTCNT0(base, index, value) (PWM_WR_DTCNT0(base, index, PWM_RD_DTCNT0(base, index) & ~(value)))
#define PWM_TOG_DTCNT0(base, index, value) (PWM_WR_DTCNT0(base, index, PWM_RD_DTCNT0(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_DTCNT0 bitfields
 */

/*!
 * @name Register PWM_DTCNT0, field DTCNT0[10:0] (RW)
 *
 * The DTCNT0 field is used to control the deadtime during 0 to 1 transitions of
 * the PWM_A output (assuming normal polarity).
 */
/*@{*/
/*! @brief Read current value of the PWM_DTCNT0_DTCNT0 field. */
#define PWM_RD_DTCNT0_DTCNT0(base, index) ((PWM_DTCNT0_REG(base, index) & PWM_DTCNT0_DTCNT0_MASK) >> PWM_DTCNT0_DTCNT0_SHIFT)
#define PWM_BRD_DTCNT0_DTCNT0(base, index) (PWM_RD_DTCNT0_DTCNT0(base, index))

/*! @brief Set the DTCNT0 field to a new value. */
#define PWM_WR_DTCNT0_DTCNT0(base, index, value) (PWM_RMW_DTCNT0(base, index, PWM_DTCNT0_DTCNT0_MASK, PWM_DTCNT0_DTCNT0(value)))
#define PWM_BWR_DTCNT0_DTCNT0(base, index, value) (PWM_WR_DTCNT0_DTCNT0(base, index, value))
/*@}*/

/*******************************************************************************
 * PWM_DTCNT1 - Deadtime Count Register 1
 ******************************************************************************/

/*!
 * @brief PWM_DTCNT1 - Deadtime Count Register 1 (RW)
 *
 * Reset value: 0x07FFU
 *
 * Deadtime operation applies only to complementary channel operation. The
 * values written to the DTCNTx registers are in terms of IPBus clock cycles
 * regardless of the setting of CTRL[PRSC] and/or CTRL2[CLK_SEL]. Reset sets the deadtime
 * count registers to a default value of 0x07FF, selecting a deadtime of 2047
 * IPBus clock cycles. The DTCNTx registers are not byte accessible.
 */
/*!
 * @name Constants and macros for entire PWM_DTCNT1 register
 */
/*@{*/
#define PWM_RD_DTCNT1(base, index) (PWM_DTCNT1_REG(base, index))
#define PWM_WR_DTCNT1(base, index, value) (PWM_DTCNT1_REG(base, index) = (value))
#define PWM_RMW_DTCNT1(base, index, mask, value) (PWM_WR_DTCNT1(base, index, (PWM_RD_DTCNT1(base, index) & ~(mask)) | (value)))
#define PWM_SET_DTCNT1(base, index, value) (PWM_WR_DTCNT1(base, index, PWM_RD_DTCNT1(base, index) |  (value)))
#define PWM_CLR_DTCNT1(base, index, value) (PWM_WR_DTCNT1(base, index, PWM_RD_DTCNT1(base, index) & ~(value)))
#define PWM_TOG_DTCNT1(base, index, value) (PWM_WR_DTCNT1(base, index, PWM_RD_DTCNT1(base, index) ^  (value)))
/*@}*/

