theatrus/ksdk/platform/devices/MKV43F15/include/MKV43F15_extension.h
/*******************************************************************************
 * PWM_CAPTCOMPX - Capture Compare X Register
 ******************************************************************************/

/*!
 * @brief PWM_CAPTCOMPX - Capture Compare X Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CAPTCOMPX register
 */
/*@{*/
#define PWM_RD_CAPTCOMPX(base, index) (PWM_CAPTCOMPX_REG(base, index))
#define PWM_WR_CAPTCOMPX(base, index, value) (PWM_CAPTCOMPX_REG(base, index) = (value))
#define PWM_RMW_CAPTCOMPX(base, index, mask, value) (PWM_WR_CAPTCOMPX(base, index, (PWM_RD_CAPTCOMPX(base, index) & ~(mask)) | (value)))
#define PWM_SET_CAPTCOMPX(base, index, value) (PWM_WR_CAPTCOMPX(base, index, PWM_RD_CAPTCOMPX(base, index) |  (value)))
#define PWM_CLR_CAPTCOMPX(base, index, value) (PWM_WR_CAPTCOMPX(base, index, PWM_RD_CAPTCOMPX(base, index) & ~(value)))
#define PWM_TOG_CAPTCOMPX(base, index, value) (PWM_WR_CAPTCOMPX(base, index, PWM_RD_CAPTCOMPX(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_CAPTCOMPX bitfields
 */

/*!
 * @name Register PWM_CAPTCOMPX, field EDGCMPX[7:0] (RW)
 *
 * This read/write field is the compare value associated with the edge counter
 * for the PWM_X input capture circuitry.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCOMPX_EDGCMPX field. */
#define PWM_RD_CAPTCOMPX_EDGCMPX(base, index) ((PWM_CAPTCOMPX_REG(base, index) & PWM_CAPTCOMPX_EDGCMPX_MASK) >> PWM_CAPTCOMPX_EDGCMPX_SHIFT)
#define PWM_BRD_CAPTCOMPX_EDGCMPX(base, index) (PWM_RD_CAPTCOMPX_EDGCMPX(base, index))

/*! @brief Set the EDGCMPX field to a new value. */
#define PWM_WR_CAPTCOMPX_EDGCMPX(base, index, value) (PWM_RMW_CAPTCOMPX(base, index, PWM_CAPTCOMPX_EDGCMPX_MASK, PWM_CAPTCOMPX_EDGCMPX(value)))
#define PWM_BWR_CAPTCOMPX_EDGCMPX(base, index, value) (PWM_WR_CAPTCOMPX_EDGCMPX(base, index, value))
/*@}*/

/*!
 * @name Register PWM_CAPTCOMPX, field EDGCNTX[15:8] (RO)
 *
 * This read-only field contains the edge counter value for the PWM_X input
 * capture circuitry.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCOMPX_EDGCNTX field. */
#define PWM_RD_CAPTCOMPX_EDGCNTX(base, index) ((PWM_CAPTCOMPX_REG(base, index) & PWM_CAPTCOMPX_EDGCNTX_MASK) >> PWM_CAPTCOMPX_EDGCNTX_SHIFT)
#define PWM_BRD_CAPTCOMPX_EDGCNTX(base, index) (PWM_RD_CAPTCOMPX_EDGCNTX(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL0 - Capture Value 0 Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL0 - Capture Value 0 Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL0 register
 */
/*@{*/
#define PWM_RD_CVAL0(base, index) (PWM_CVAL0_REG(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL0CYC - Capture Value 0 Cycle Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL0CYC - Capture Value 0 Cycle Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL0CYC register
 */
/*@{*/
#define PWM_RD_CVAL0CYC(base, index) (PWM_CVAL0CYC_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual PWM_CVAL0CYC bitfields
 */

/*!
 * @name Register PWM_CVAL0CYC, field CVAL0CYC[3:0] (RO)
 *
 * This read-only register stores the cycle number corresponding to the value
 * captured in CVAL0. This register is incremented each time the counter is loaded
 * with the INIT value at the end of a PWM modulo cycle.
 */
/*@{*/
/*! @brief Read current value of the PWM_CVAL0CYC_CVAL0CYC field. */
#define PWM_RD_CVAL0CYC_CVAL0CYC(base, index) ((PWM_CVAL0CYC_REG(base, index) & PWM_CVAL0CYC_CVAL0CYC_MASK) >> PWM_CVAL0CYC_CVAL0CYC_SHIFT)
#define PWM_BRD_CVAL0CYC_CVAL0CYC(base, index) (PWM_RD_CVAL0CYC_CVAL0CYC(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL1 - Capture Value 1 Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL1 - Capture Value 1 Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL1 register
 */
/*@{*/
#define PWM_RD_CVAL1(base, index) (PWM_CVAL1_REG(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL1CYC - Capture Value 1 Cycle Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL1CYC - Capture Value 1 Cycle Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL1CYC register
 */
/*@{*/
#define PWM_RD_CVAL1CYC(base, index) (PWM_CVAL1CYC_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual PWM_CVAL1CYC bitfields
 */

/*!
 * @name Register PWM_CVAL1CYC, field CVAL1CYC[3:0] (RO)
 *
 * This read-only register stores the cycle number corresponding to the value
 * captured in CVAL1. This register is incremented each time the counter is loaded
 * with the INIT value at the end of a PWM modulo cycle.
 */
/*@{*/
/*! @brief Read current value of the PWM_CVAL1CYC_CVAL1CYC field. */
#define PWM_RD_CVAL1CYC_CVAL1CYC(base, index) ((PWM_CVAL1CYC_REG(base, index) & PWM_CVAL1CYC_CVAL1CYC_MASK) >> PWM_CVAL1CYC_CVAL1CYC_SHIFT)
#define PWM_BRD_CVAL1CYC_CVAL1CYC(base, index) (PWM_RD_CVAL1CYC_CVAL1CYC(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL2 - Capture Value 2 Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL2 - Capture Value 2 Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL2 register
 */
/*@{*/
#define PWM_RD_CVAL2(base, index) (PWM_CVAL2_REG(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL2CYC - Capture Value 2 Cycle Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL2CYC - Capture Value 2 Cycle Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL2CYC register
 */
/*@{*/
#define PWM_RD_CVAL2CYC(base, index) (PWM_CVAL2CYC_REG(base, index))
/*@}*/

