theatrus/ksdk/platform/devices/MKV43F15/include/MKV43F15_extension.h
/*******************************************************************************
 * PWM_SWCOUT - Software Controlled Output Register
 ******************************************************************************/

/*!
 * @brief PWM_SWCOUT - Software Controlled Output Register (RW)
 *
 * Reset value: 0x0000U
 *
 * These bits are double buffered and do not take effect until a FORCE_OUT event
 * occurs within the appropriate submodule. Reading these bits reads the
 * buffered value and not necessarily the value currently in effect.
 */
/*!
 * @name Constants and macros for entire PWM_SWCOUT register
 */
/*@{*/
#define PWM_RD_SWCOUT(base)      (PWM_SWCOUT_REG(base))
#define PWM_WR_SWCOUT(base, value) (PWM_SWCOUT_REG(base) = (value))
#define PWM_RMW_SWCOUT(base, mask, value) (PWM_WR_SWCOUT(base, (PWM_RD_SWCOUT(base) & ~(mask)) | (value)))
#define PWM_SET_SWCOUT(base, value) (PWM_WR_SWCOUT(base, PWM_RD_SWCOUT(base) |  (value)))
#define PWM_CLR_SWCOUT(base, value) (PWM_WR_SWCOUT(base, PWM_RD_SWCOUT(base) & ~(value)))
#define PWM_TOG_SWCOUT(base, value) (PWM_WR_SWCOUT(base, PWM_RD_SWCOUT(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_SWCOUT bitfields
 */

/*!
 * @name Register PWM_SWCOUT, field SM0OUT45[0] (RW)
 *
 * This bit is only used when DTSRCSEL[SM0SEL45] is set to b10. It allows
 * software control of which signal is supplied to the deadtime generator of that
 * submodule.
 *
 * Values:
 * - 0 - A logic 0 is supplied to the deadtime generator of submodule 0 instead
 *     of PWM45.
 * - 1 - A logic 1 is supplied to the deadtime generator of submodule 0 instead
 *     of PWM45.
 */
/*@{*/
/*! @brief Read current value of the PWM_SWCOUT_SM0OUT45 field. */
#define PWM_RD_SWCOUT_SM0OUT45(base) ((PWM_SWCOUT_REG(base) & PWM_SWCOUT_SM0OUT45_MASK) >> PWM_SWCOUT_SM0OUT45_SHIFT)
#define PWM_BRD_SWCOUT_SM0OUT45(base) (BITBAND_ACCESS16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM0OUT45_SHIFT))

/*! @brief Set the SM0OUT45 field to a new value. */
#define PWM_WR_SWCOUT_SM0OUT45(base, value) (PWM_RMW_SWCOUT(base, PWM_SWCOUT_SM0OUT45_MASK, PWM_SWCOUT_SM0OUT45(value)))
#define PWM_BWR_SWCOUT_SM0OUT45(base, value) (BITBAND_ACCESS16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM0OUT45_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_SWCOUT, field SM0OUT23[1] (RW)
 *
 * This bit is only used when DTSRCSEL[SM0SEL23] is set to b10. It allows
 * software control of which signal is supplied to the deadtime generator of that
 * submodule.
 *
 * Values:
 * - 0 - A logic 0 is supplied to the deadtime generator of submodule 0 instead
 *     of PWM23.
 * - 1 - A logic 1 is supplied to the deadtime generator of submodule 0 instead
 *     of PWM23.
 */
/*@{*/
/*! @brief Read current value of the PWM_SWCOUT_SM0OUT23 field. */
#define PWM_RD_SWCOUT_SM0OUT23(base) ((PWM_SWCOUT_REG(base) & PWM_SWCOUT_SM0OUT23_MASK) >> PWM_SWCOUT_SM0OUT23_SHIFT)
#define PWM_BRD_SWCOUT_SM0OUT23(base) (BITBAND_ACCESS16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM0OUT23_SHIFT))

/*! @brief Set the SM0OUT23 field to a new value. */
#define PWM_WR_SWCOUT_SM0OUT23(base, value) (PWM_RMW_SWCOUT(base, PWM_SWCOUT_SM0OUT23_MASK, PWM_SWCOUT_SM0OUT23(value)))
#define PWM_BWR_SWCOUT_SM0OUT23(base, value) (BITBAND_ACCESS16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM0OUT23_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_SWCOUT, field SM1OUT45[2] (RW)
 *
 * This bit is only used when DTSRCSEL[SM1SEL45] is set to b10. It allows
 * software control of which signal is supplied to the deadtime generator of that
 * submodule.
 *
 * Values:
 * - 0 - A logic 0 is supplied to the deadtime generator of submodule 1 instead
 *     of PWM45.
 * - 1 - A logic 1 is supplied to the deadtime generator of submodule 1 instead
 *     of PWM45.
 */
/*@{*/
/*! @brief Read current value of the PWM_SWCOUT_SM1OUT45 field. */
#define PWM_RD_SWCOUT_SM1OUT45(base) ((PWM_SWCOUT_REG(base) & PWM_SWCOUT_SM1OUT45_MASK) >> PWM_SWCOUT_SM1OUT45_SHIFT)
#define PWM_BRD_SWCOUT_SM1OUT45(base) (BITBAND_ACCESS16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM1OUT45_SHIFT))

/*! @brief Set the SM1OUT45 field to a new value. */
#define PWM_WR_SWCOUT_SM1OUT45(base, value) (PWM_RMW_SWCOUT(base, PWM_SWCOUT_SM1OUT45_MASK, PWM_SWCOUT_SM1OUT45(value)))
#define PWM_BWR_SWCOUT_SM1OUT45(base, value) (BITBAND_ACCESS16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM1OUT45_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_SWCOUT, field SM1OUT23[3] (RW)
 *
 * This bit is only used when DTSRCSEL[SM1SEL23] is set to b10. It allows
 * software control of which signal is supplied to the deadtime generator of that
 * submodule.
 *
 * Values:
 * - 0 - A logic 0 is supplied to the deadtime generator of submodule 1 instead
 *     of PWM23.
 * - 1 - A logic 1 is supplied to the deadtime generator of submodule 1 instead
 *     of PWM23.
 */
/*@{*/
/*! @brief Read current value of the PWM_SWCOUT_SM1OUT23 field. */
#define PWM_RD_SWCOUT_SM1OUT23(base) ((PWM_SWCOUT_REG(base) & PWM_SWCOUT_SM1OUT23_MASK) >> PWM_SWCOUT_SM1OUT23_SHIFT)
#define PWM_BRD_SWCOUT_SM1OUT23(base) (BITBAND_ACCESS16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM1OUT23_SHIFT))

/*! @brief Set the SM1OUT23 field to a new value. */
#define PWM_WR_SWCOUT_SM1OUT23(base, value) (PWM_RMW_SWCOUT(base, PWM_SWCOUT_SM1OUT23_MASK, PWM_SWCOUT_SM1OUT23(value)))
#define PWM_BWR_SWCOUT_SM1OUT23(base, value) (BITBAND_ACCESS16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM1OUT23_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_SWCOUT, field SM2OUT45[4] (RW)
 *
 * This bit is only used when DTSRCSEL[SM2SEL45] is set to b10. It allows
 * software control of which signal is supplied to the deadtime generator of that
 * submodule.
 *
 * Values:
 * - 0 - A logic 0 is supplied to the deadtime generator of submodule 2 instead
 *     of PWM45.
 * - 1 - A logic 1 is supplied to the deadtime generator of submodule 2 instead
 *     of PWM45.
 */
/*@{*/
/*! @brief Read current value of the PWM_SWCOUT_SM2OUT45 field. */
#define PWM_RD_SWCOUT_SM2OUT45(base) ((PWM_SWCOUT_REG(base) & PWM_SWCOUT_SM2OUT45_MASK) >> PWM_SWCOUT_SM2OUT45_SHIFT)
#define PWM_BRD_SWCOUT_SM2OUT45(base) (BITBAND_ACCESS16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM2OUT45_SHIFT))

/*! @brief Set the SM2OUT45 field to a new value. */
#define PWM_WR_SWCOUT_SM2OUT45(base, value) (PWM_RMW_SWCOUT(base, PWM_SWCOUT_SM2OUT45_MASK, PWM_SWCOUT_SM2OUT45(value)))
#define PWM_BWR_SWCOUT_SM2OUT45(base, value) (BITBAND_ACCESS16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM2OUT45_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_SWCOUT, field SM2OUT23[5] (RW)
 *
 * This bit is only used when DTSRCSEL[SM2SEL23] is set to b10. It allows
 * software control of which signal is supplied to the deadtime generator of that
 * submodule.
 *
 * Values:
 * - 0 - A logic 0 is supplied to the deadtime generator of submodule 2 instead
 *     of PWM23.
 * - 1 - A logic 1 is supplied to the deadtime generator of submodule 2 instead
 *     of PWM23.
 */
/*@{*/
/*! @brief Read current value of the PWM_SWCOUT_SM2OUT23 field. */
#define PWM_RD_SWCOUT_SM2OUT23(base) ((PWM_SWCOUT_REG(base) & PWM_SWCOUT_SM2OUT23_MASK) >> PWM_SWCOUT_SM2OUT23_SHIFT)
#define PWM_BRD_SWCOUT_SM2OUT23(base) (BITBAND_ACCESS16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM2OUT23_SHIFT))

