theatrus/ksdk/platform/devices/MKV43F15/include/MKV43F15_extension.h
/*
 * Constants & macros for individual PWM_FSTS bitfields
 */

/*!
 * @name Register PWM_FSTS, field FFLAG[3:0] (W1C)
 *
 * These read-only flag is set within two CPU cycles after a transition to
 * active on the FAULTx pin. Clear this bit by writing a logic one to it. A reset
 * clears this field. While the reset value is 0, these bits may be set to 1 by the
 * time they can be read depending on the state of the fault input signals.
 *
 * Values:
 * - 0 - No fault on the FAULTx pin.
 * - 1 - Fault on the FAULTx pin.
 */
/*@{*/
/*! @brief Read current value of the PWM_FSTS_FFLAG field. */
#define PWM_RD_FSTS_FFLAG(base) ((PWM_FSTS_REG(base) & PWM_FSTS_FFLAG_MASK) >> PWM_FSTS_FFLAG_SHIFT)
#define PWM_BRD_FSTS_FFLAG(base) (PWM_RD_FSTS_FFLAG(base))

/*! @brief Set the FFLAG field to a new value. */
#define PWM_WR_FSTS_FFLAG(base, value) (PWM_RMW_FSTS(base, PWM_FSTS_FFLAG_MASK, PWM_FSTS_FFLAG(value)))
#define PWM_BWR_FSTS_FFLAG(base, value) (PWM_WR_FSTS_FFLAG(base, value))
/*@}*/

/*!
 * @name Register PWM_FSTS, field FFULL[7:4] (RW)
 *
 * These read/write bits are used to control the timing for re-enabling the PWM
 * outputs after a fault condition. These bits apply to both automatic and manual
 * clearing of a fault condition. Both FHALF and FFULL can be set so that the
 * fault recovery occurs at the start of a full cycle and at the start of a half
 * cycle (as defined by VAL0). If neither FHALF nor FFULL is set, then no fault
 * recovery is possible.
 *
 * Values:
 * - 0 - PWM outputs are not re-enabled at the start of a full cycle
 * - 1 - PWM outputs are re-enabled at the start of a full cycle
 */
/*@{*/
/*! @brief Read current value of the PWM_FSTS_FFULL field. */
#define PWM_RD_FSTS_FFULL(base) ((PWM_FSTS_REG(base) & PWM_FSTS_FFULL_MASK) >> PWM_FSTS_FFULL_SHIFT)
#define PWM_BRD_FSTS_FFULL(base) (PWM_RD_FSTS_FFULL(base))

/*! @brief Set the FFULL field to a new value. */
#define PWM_WR_FSTS_FFULL(base, value) (PWM_RMW_FSTS(base, (PWM_FSTS_FFULL_MASK | PWM_FSTS_FFLAG_MASK), PWM_FSTS_FFULL(value)))
#define PWM_BWR_FSTS_FFULL(base, value) (PWM_WR_FSTS_FFULL(base, value))
/*@}*/

/*!
 * @name Register PWM_FSTS, field FFPIN[11:8] (RO)
 *
 * These read-only bits reflect the current state of the filtered FAULTx pins
 * converted to high polarity. A logic 1 indicates a fault condition exists on the
 * filtered FAULTx pin. A reset has no effect on this field.
 */
/*@{*/
/*! @brief Read current value of the PWM_FSTS_FFPIN field. */
#define PWM_RD_FSTS_FFPIN(base) ((PWM_FSTS_REG(base) & PWM_FSTS_FFPIN_MASK) >> PWM_FSTS_FFPIN_SHIFT)
#define PWM_BRD_FSTS_FFPIN(base) (PWM_RD_FSTS_FFPIN(base))
/*@}*/

/*!
 * @name Register PWM_FSTS, field FHALF[15:12] (RW)
 *
 * These read/write bits are used to control the timing for re-enabling the PWM
 * outputs after a fault condition. These bits apply to both automatic and manual
 * clearing of a fault condition. Both FHALF and FFULL can be set so that the
 * fault recovery occurs at the start of a full cycle and at the start of a half
 * cycle (as defined by VAL0). If neither FHALF nor FFULL is set, then no fault
 * recovery is possible.
 *
 * Values:
 * - 0 - PWM outputs are not re-enabled at the start of a half cycle.
 * - 1 - PWM outputs are re-enabled at the start of a half cycle (as defined by
 *     VAL0).
 */
/*@{*/
/*! @brief Read current value of the PWM_FSTS_FHALF field. */
#define PWM_RD_FSTS_FHALF(base) ((PWM_FSTS_REG(base) & PWM_FSTS_FHALF_MASK) >> PWM_FSTS_FHALF_SHIFT)
#define PWM_BRD_FSTS_FHALF(base) (PWM_RD_FSTS_FHALF(base))

/*! @brief Set the FHALF field to a new value. */
#define PWM_WR_FSTS_FHALF(base, value) (PWM_RMW_FSTS(base, (PWM_FSTS_FHALF_MASK | PWM_FSTS_FFLAG_MASK), PWM_FSTS_FHALF(value)))
#define PWM_BWR_FSTS_FHALF(base, value) (PWM_WR_FSTS_FHALF(base, value))
/*@}*/

/*******************************************************************************
 * PWM_FFILT - Fault Filter Register
 ******************************************************************************/

/*!
 * @brief PWM_FFILT - Fault Filter Register (RW)
 *
 * Reset value: 0x0000U
 *
 * The settings in this register are shared among each of the fault input
 * filters within the fault channel. Input filter considerations include: The FILT_PER
 * value should be set such that the sampling period is larger than the period of
 * the expected noise. This way a noise spike will only corrupt one sample. The
 * FILT_CNT value should be chosen to reduce the probability of noisy samples
 * causing an incorrect transition to be recognized. The probability of an incorrect
 * transition is defined as the probability of an incorrect sample raised to the
 * FILT_CNT+3 power. The values of FILT_PER and FILT_CNT must also be traded off
 * against the desire for minimal latency in recognizing input transitions.
 * Turning on the input filter (setting FILT_PER to a non-zero value) introduces a
 * latency of ((FILT_CNT+4) x FILT_PER x IPBus clock period). Note that even when
 * the filter is enabled, there is a combinational path to disable the PWM
 * outputs. This is to ensure rapid response to fault conditions and also to ensure
 * fault response if the PWM module loses its clock. The latency induced by the
 * filter will be seen in the time to set FSTS[FFLAG] and FSTS[FFPIN].
 */
/*!
 * @name Constants and macros for entire PWM_FFILT register
 */
/*@{*/
#define PWM_RD_FFILT(base)       (PWM_FFILT_REG(base))
#define PWM_WR_FFILT(base, value) (PWM_FFILT_REG(base) = (value))
#define PWM_RMW_FFILT(base, mask, value) (PWM_WR_FFILT(base, (PWM_RD_FFILT(base) & ~(mask)) | (value)))
#define PWM_SET_FFILT(base, value) (PWM_WR_FFILT(base, PWM_RD_FFILT(base) |  (value)))
#define PWM_CLR_FFILT(base, value) (PWM_WR_FFILT(base, PWM_RD_FFILT(base) & ~(value)))
#define PWM_TOG_FFILT(base, value) (PWM_WR_FFILT(base, PWM_RD_FFILT(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_FFILT bitfields
 */

/*!
 * @name Register PWM_FFILT, field FILT_PER[7:0] (RW)
 *
 * This 8-bit field applies universally to all fault inputs. These bits
 * represent the sampling period (in IPBus clock cycles) of the fault pin input filter.
 * Each input is sampled multiple times at the rate specified by this field. If
 * FILT_PER is 0x00 (default), then the input filter is bypassed. The value of
 * FILT_PER affects the input latency. When changing values for FILT_PER from one
 * non-zero value to another non-zero value, first write a value of zero to clear
 * the filter.
 */
/*@{*/
/*! @brief Read current value of the PWM_FFILT_FILT_PER field. */
#define PWM_RD_FFILT_FILT_PER(base) ((PWM_FFILT_REG(base) & PWM_FFILT_FILT_PER_MASK) >> PWM_FFILT_FILT_PER_SHIFT)
#define PWM_BRD_FFILT_FILT_PER(base) (PWM_RD_FFILT_FILT_PER(base))

/*! @brief Set the FILT_PER field to a new value. */
#define PWM_WR_FFILT_FILT_PER(base, value) (PWM_RMW_FFILT(base, PWM_FFILT_FILT_PER_MASK, PWM_FFILT_FILT_PER(value)))
#define PWM_BWR_FFILT_FILT_PER(base, value) (PWM_WR_FFILT_FILT_PER(base, value))
/*@}*/

/*!
 * @name Register PWM_FFILT, field FILT_CNT[10:8] (RW)
 *
 * These bits represent the number of consecutive samples that must agree prior
 * to the input filter accepting an input transition. The number of samples is
 * the decimal value of this field plus three: the bitfield value of 0-7 represents
 * 3-10 samples, respectively. The value of FILT_CNT affects the input latency.
 */
/*@{*/
/*! @brief Read current value of the PWM_FFILT_FILT_CNT field. */
#define PWM_RD_FFILT_FILT_CNT(base) ((PWM_FFILT_REG(base) & PWM_FFILT_FILT_CNT_MASK) >> PWM_FFILT_FILT_CNT_SHIFT)
#define PWM_BRD_FFILT_FILT_CNT(base) (PWM_RD_FFILT_FILT_CNT(base))

/*! @brief Set the FILT_CNT field to a new value. */
#define PWM_WR_FFILT_FILT_CNT(base, value) (PWM_RMW_FFILT(base, PWM_FFILT_FILT_CNT_MASK, PWM_FFILT_FILT_CNT(value)))
#define PWM_BWR_FFILT_FILT_CNT(base, value) (PWM_WR_FFILT_FILT_CNT(base, value))
/*@}*/

/*!
 * @name Register PWM_FFILT, field GSTR[15] (RW)
 *
 * This bit is used to enable the fault glitch stretching logic. This logic
 * ensures that narrow fault glitches are stretched to be at least 2 IPBus clock
 * cycles wide. In some cases a narrow fault input can cause problems due to the
 * short PWM output shutdown/re-activation time. The stretching logic ensures that a
 * glitch on the fault input, when the fault filter is disabled, will be
 * registered in the fault flags.
 *
 * Values:
 * - 0 - Fault input glitch stretching is disabled.
 * - 1 - Input fault signals will be stretched to at least 2 IPBus clock cycles.
 */
/*@{*/
/*! @brief Read current value of the PWM_FFILT_GSTR field. */
#define PWM_RD_FFILT_GSTR(base) ((PWM_FFILT_REG(base) & PWM_FFILT_GSTR_MASK) >> PWM_FFILT_GSTR_SHIFT)
#define PWM_BRD_FFILT_GSTR(base) (BITBAND_ACCESS16(&PWM_FFILT_REG(base), PWM_FFILT_GSTR_SHIFT))

/*! @brief Set the GSTR field to a new value. */
#define PWM_WR_FFILT_GSTR(base, value) (PWM_RMW_FFILT(base, PWM_FFILT_GSTR_MASK, PWM_FFILT_GSTR(value)))
#define PWM_BWR_FFILT_GSTR(base, value) (BITBAND_ACCESS16(&PWM_FFILT_REG(base), PWM_FFILT_GSTR_SHIFT) = (value))
/*@}*/

