theatrus/ksdk/platform/devices/MKV43F15/include/MKV43F15_extension.h
/*******************************************************************************
 * SIM_SOPT9 - System Options Register 9
 ******************************************************************************/

/*!
 * @brief SIM_SOPT9 - System Options Register 9 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SOPT9 register
 */
/*@{*/
#define SIM_RD_SOPT9(base)       (SIM_SOPT9_REG(base))
#define SIM_WR_SOPT9(base, value) (SIM_SOPT9_REG(base) = (value))
#define SIM_RMW_SOPT9(base, mask, value) (SIM_WR_SOPT9(base, (SIM_RD_SOPT9(base) & ~(mask)) | (value)))
#define SIM_SET_SOPT9(base, value) (SIM_WR_SOPT9(base, SIM_RD_SOPT9(base) |  (value)))
#define SIM_CLR_SOPT9(base, value) (SIM_WR_SOPT9(base, SIM_RD_SOPT9(base) & ~(value)))
#define SIM_TOG_SOPT9(base, value) (SIM_WR_SOPT9(base, SIM_RD_SOPT9(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT9 bitfields
 */

/*!
 * @name Register SIM_SOPT9, field FTM1ICH0SRC[5:4] (RW)
 *
 * Selects the source for FTM1 channel 0 input capture. When the FTM is not in
 * input capture mode, clear this field.
 *
 * Values:
 * - 00 - FTM1_CH0 signal
 * - 01 - CMP0 output
 * - 10 - CMP1 output
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM1ICH0SRC field. */
#define SIM_RD_SOPT9_FTM1ICH0SRC(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM1ICH0SRC_MASK) >> SIM_SOPT9_FTM1ICH0SRC_SHIFT)
#define SIM_BRD_SOPT9_FTM1ICH0SRC(base) (SIM_RD_SOPT9_FTM1ICH0SRC(base))

/*! @brief Set the FTM1ICH0SRC field to a new value. */
#define SIM_WR_SOPT9_FTM1ICH0SRC(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM1ICH0SRC_MASK, SIM_SOPT9_FTM1ICH0SRC(value)))
#define SIM_BWR_SOPT9_FTM1ICH0SRC(base, value) (SIM_WR_SOPT9_FTM1ICH0SRC(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM1ICH1SRC[6] (RW)
 *
 * Selects the source for FTM1 channel 0 input capture. When the FTM is not in
 * input capture mode, clear this field.
 *
 * Values:
 * - 0 - FTM1_CH1 signal
 * - 1 - Exclusive OR of FTM1_CH1, FTM1_CH0 and XBARA output 42
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM1ICH1SRC field. */
#define SIM_RD_SOPT9_FTM1ICH1SRC(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM1ICH1SRC_MASK) >> SIM_SOPT9_FTM1ICH1SRC_SHIFT)
#define SIM_BRD_SOPT9_FTM1ICH1SRC(base) (BITBAND_ACCESS32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM1ICH1SRC_SHIFT))

/*! @brief Set the FTM1ICH1SRC field to a new value. */
#define SIM_WR_SOPT9_FTM1ICH1SRC(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM1ICH1SRC_MASK, SIM_SOPT9_FTM1ICH1SRC(value)))
#define SIM_BWR_SOPT9_FTM1ICH1SRC(base, value) (BITBAND_ACCESS32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM1ICH1SRC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM0CLKSEL[25:24] (RW)
 *
 * Selects the external pin used to drive the clock to the FTM0 module. The
 * selected pin must also be configured for the FTM0 module external clock function
 * through the appropriate pin control register in the port control module.
 *
 * Values:
 * - 00 - FTM0 external clock driven by FTM_CLK0 pin
 * - 01 - FTM0 external clock driven by FTM_CLK1 pin
 * - 10 - FTM0 external clock driven by FTM_CLK2 pin
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM0CLKSEL field. */
#define SIM_RD_SOPT9_FTM0CLKSEL(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM0CLKSEL_MASK) >> SIM_SOPT9_FTM0CLKSEL_SHIFT)
#define SIM_BRD_SOPT9_FTM0CLKSEL(base) (SIM_RD_SOPT9_FTM0CLKSEL(base))

/*! @brief Set the FTM0CLKSEL field to a new value. */
#define SIM_WR_SOPT9_FTM0CLKSEL(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM0CLKSEL_MASK, SIM_SOPT9_FTM0CLKSEL(value)))
#define SIM_BWR_SOPT9_FTM0CLKSEL(base, value) (SIM_WR_SOPT9_FTM0CLKSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM1CLKSEL[27:26] (RW)
 *
 * Selects the external pin used to drive the clock to the FTM1 module. The
 * selected pin must also be configured for the FTM1 module external clock function
 * through the appropriate pin control register in the port control module.
 *
 * Values:
 * - 00 - FTM1 external clock driven by FTM_CLK0 pin
 * - 01 - FTM1 external clock driven by FTM_CLK1 pin
 * - 10 - FTM1 external clock driven by FTM_CLK2 pin
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM1CLKSEL field. */
#define SIM_RD_SOPT9_FTM1CLKSEL(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM1CLKSEL_MASK) >> SIM_SOPT9_FTM1CLKSEL_SHIFT)
#define SIM_BRD_SOPT9_FTM1CLKSEL(base) (SIM_RD_SOPT9_FTM1CLKSEL(base))

/*! @brief Set the FTM1CLKSEL field to a new value. */
#define SIM_WR_SOPT9_FTM1CLKSEL(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM1CLKSEL_MASK, SIM_SOPT9_FTM1CLKSEL(value)))
#define SIM_BWR_SOPT9_FTM1CLKSEL(base, value) (SIM_WR_SOPT9_FTM1CLKSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM3CLKSEL[31:30] (RW)
 *
 * Selects the external pin used to drive the clock to the FTM3 module. The
 * selected pin must also be configured for the FTM3 module external clock function
 * through the appropriate pin control register in the port control module.
 *
 * Values:
 * - 00 - FTM3 external clock driven by FTM_CLK0 pin
 * - 01 - FTM3 external clock driven by FTM_CLK1 pin
 * - 10 - FTM3 external clock driven by FTM_CLK2 pin
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM3CLKSEL field. */
#define SIM_RD_SOPT9_FTM3CLKSEL(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM3CLKSEL_MASK) >> SIM_SOPT9_FTM3CLKSEL_SHIFT)
#define SIM_BRD_SOPT9_FTM3CLKSEL(base) (SIM_RD_SOPT9_FTM3CLKSEL(base))

/*! @brief Set the FTM3CLKSEL field to a new value. */
#define SIM_WR_SOPT9_FTM3CLKSEL(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM3CLKSEL_MASK, SIM_SOPT9_FTM3CLKSEL(value)))
#define SIM_BWR_SOPT9_FTM3CLKSEL(base, value) (SIM_WR_SOPT9_FTM3CLKSEL(base, value))
/*@}*/

/*******************************************************************************
 * SIM_SDID - System Device Identification Register
 ******************************************************************************/

/*!
 * @brief SIM_SDID - System Device Identification Register (RO)
 *
 * Reset value: 0x40600100U
 */
/*!
 * @name Constants and macros for entire SIM_SDID register
 */
/*@{*/
#define SIM_RD_SDID(base)        (SIM_SDID_REG(base))
/*@}*/

