theatrus/ksdk/platform/devices/MKV43F15/include/MKV43F15_extension.h
/*******************************************************************************
 * SIM_WDOGC - WDOG Control Register
 ******************************************************************************/

/*!
 * @brief SIM_WDOGC - WDOG Control Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_WDOGC register
 */
/*@{*/
#define SIM_RD_WDOGC(base)       (SIM_WDOGC_REG(base))
#define SIM_WR_WDOGC(base, value) (SIM_WDOGC_REG(base) = (value))
#define SIM_RMW_WDOGC(base, mask, value) (SIM_WR_WDOGC(base, (SIM_RD_WDOGC(base) & ~(mask)) | (value)))
#define SIM_SET_WDOGC(base, value) (SIM_WR_WDOGC(base, SIM_RD_WDOGC(base) |  (value)))
#define SIM_CLR_WDOGC(base, value) (SIM_WR_WDOGC(base, SIM_RD_WDOGC(base) & ~(value)))
#define SIM_TOG_WDOGC(base, value) (SIM_WR_WDOGC(base, SIM_RD_WDOGC(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_WDOGC bitfields
 */

/*!
 * @name Register SIM_WDOGC, field WDOGCLKS[1] (RW)
 *
 * This write-once bit selects the clock source of the WDOG2008 watchdog. This
 * is the choice of two alternative clock sources that goto the ALTCLK of the
 * WDOG2008.
 *
 * Values:
 * - 0 - Internal 1 kHz clock is source to WDOG2008
 * - 1 - MCGIRCLK is source to WDOG2008
 */
/*@{*/
/*! @brief Read current value of the SIM_WDOGC_WDOGCLKS field. */
#define SIM_RD_WDOGC_WDOGCLKS(base) ((SIM_WDOGC_REG(base) & SIM_WDOGC_WDOGCLKS_MASK) >> SIM_WDOGC_WDOGCLKS_SHIFT)
#define SIM_BRD_WDOGC_WDOGCLKS(base) (BITBAND_ACCESS32(&SIM_WDOGC_REG(base), SIM_WDOGC_WDOGCLKS_SHIFT))

/*! @brief Set the WDOGCLKS field to a new value. */
#define SIM_WR_WDOGC_WDOGCLKS(base, value) (SIM_RMW_WDOGC(base, SIM_WDOGC_WDOGCLKS_MASK, SIM_WDOGC_WDOGCLKS(value)))
#define SIM_BWR_WDOGC_WDOGCLKS(base, value) (BITBAND_ACCESS32(&SIM_WDOGC_REG(base), SIM_WDOGC_WDOGCLKS_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * SIM_PWRC - Power Control Register
 ******************************************************************************/

/*!
 * @brief SIM_PWRC - Power Control Register (RW)
 *
 * Reset value: 0x00000101U
 *
 * Setting PMC_REGSC[BGBE] before nanoedge regulator is enabled, because the
 * regulator uses 1v reference of PMC.
 */
/*!
 * @name Constants and macros for entire SIM_PWRC register
 */
/*@{*/
#define SIM_RD_PWRC(base)        (SIM_PWRC_REG(base))
#define SIM_WR_PWRC(base, value) (SIM_PWRC_REG(base) = (value))
#define SIM_RMW_PWRC(base, mask, value) (SIM_WR_PWRC(base, (SIM_RD_PWRC(base) & ~(mask)) | (value)))
#define SIM_SET_PWRC(base, value) (SIM_WR_PWRC(base, SIM_RD_PWRC(base) |  (value)))
#define SIM_CLR_PWRC(base, value) (SIM_WR_PWRC(base, SIM_RD_PWRC(base) & ~(value)))
#define SIM_TOG_PWRC(base, value) (SIM_WR_PWRC(base, SIM_RD_PWRC(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_PWRC bitfields
 */

/*!
 * @name Register SIM_PWRC, field SRPDN[1:0] (RW)
 *
 * This field controls the powerdown mode of the 2.7V and 1.2V supply from the
 * nanoedge voltage regulator. Powerdown mode shuts down the 2.7V and 1.2V
 * regulated supply from the nanoedge regulator and eliminates its power consumption.
 * Analog modules powered by this supply should themselves be powered down before
 * entering this mode.
 *
 * Values:
 * - 00 - Nanoedge regulator placed in normal mode.
 * - 01 - Nanoedge regulator placed in powerdown mode.
 * - 10 - Nanoedge regulator placed in normal mode and SRPDN is write protected
 *     until chip reset.
 * - 11 - Nanoedge regulator placed in powerdown mode and SRPDN is write
 *     protected until chip reset.
 */
/*@{*/
/*! @brief Read current value of the SIM_PWRC_SRPDN field. */
#define SIM_RD_PWRC_SRPDN(base) ((SIM_PWRC_REG(base) & SIM_PWRC_SRPDN_MASK) >> SIM_PWRC_SRPDN_SHIFT)
#define SIM_BRD_PWRC_SRPDN(base) (SIM_RD_PWRC_SRPDN(base))

/*! @brief Set the SRPDN field to a new value. */
#define SIM_WR_PWRC_SRPDN(base, value) (SIM_RMW_PWRC(base, SIM_PWRC_SRPDN_MASK, SIM_PWRC_SRPDN(value)))
#define SIM_BWR_PWRC_SRPDN(base, value) (SIM_WR_PWRC_SRPDN(base, value))
/*@}*/

/*!
 * @name Register SIM_PWRC, field SR27STDBY[3:2] (RW)
 *
 * This field controls the standby mode of the 2.7 V supply from the nanoedge
 * voltage regulator. Standby mode has restricted drive capacity but substantially
 * reduces power consumption. The field value can be optionally write protected.
 *
 * Values:
 * - 00 - Nanoedge regulator 2.7 V placed in normal mode.
 * - 01 - Nanoedge regulator 2.7 V placed in standby mode.
 * - 10 - Nanoedge regulator 2.7 V supply placed in normal mode and SR27STDBY is
 *     write protected until chip reset.
 * - 11 - Nanoedge regulator 2.7 V supply placed in standby mode and SR27STDBY
 *     is write protected until chip reset.
 */
/*@{*/
/*! @brief Read current value of the SIM_PWRC_SR27STDBY field. */
#define SIM_RD_PWRC_SR27STDBY(base) ((SIM_PWRC_REG(base) & SIM_PWRC_SR27STDBY_MASK) >> SIM_PWRC_SR27STDBY_SHIFT)
#define SIM_BRD_PWRC_SR27STDBY(base) (SIM_RD_PWRC_SR27STDBY(base))

/*! @brief Set the SR27STDBY field to a new value. */
#define SIM_WR_PWRC_SR27STDBY(base, value) (SIM_RMW_PWRC(base, SIM_PWRC_SR27STDBY_MASK, SIM_PWRC_SR27STDBY(value)))
#define SIM_BWR_PWRC_SR27STDBY(base, value) (SIM_WR_PWRC_SR27STDBY(base, value))
/*@}*/

/*!
 * @name Register SIM_PWRC, field SR12STDBY[7:6] (RW)
 *
 * This field controls the standby mode of the 1.2 V supply from the nanoedge
 * voltage regulator. Standby mode has restricted drive capacity but substantially
 * reduces power consumption. The field value can be optionally write protected.
 *
 * Values:
 * - 00 - Nanoedge regulator 1.2 V supply placed in normal mode
 * - 01 - Nanoedge regulator 1.2 V supply placed in standby mode.
 * - 10 - Nanoedge regulator 1.2 V supply placed in normal mode and SR12STDBY is
 *     write protected until chip reset.
 * - 11 - Nanoedge regulator 1.2 V supply placed in standby mode and SR12STDBY
 *     is write protected until chip reset.
 */
/*@{*/
/*! @brief Read current value of the SIM_PWRC_SR12STDBY field. */
#define SIM_RD_PWRC_SR12STDBY(base) ((SIM_PWRC_REG(base) & SIM_PWRC_SR12STDBY_MASK) >> SIM_PWRC_SR12STDBY_SHIFT)
#define SIM_BRD_PWRC_SR12STDBY(base) (SIM_RD_PWRC_SR12STDBY(base))

/*! @brief Set the SR12STDBY field to a new value. */
#define SIM_WR_PWRC_SR12STDBY(base, value) (SIM_RMW_PWRC(base, SIM_PWRC_SR12STDBY_MASK, SIM_PWRC_SR12STDBY(value)))
#define SIM_BWR_PWRC_SR12STDBY(base, value) (SIM_WR_PWRC_SR12STDBY(base, value))
/*@}*/

/*!
 * @name Register SIM_PWRC, field SRPWRDETEN[8] (RW)
 *
 * Write 1 to enable Nanoedge PMC power dectect to assert PMC ready signal when
 * PMC is stable.
 *
 * Values:
 * - 0 - Disable
 * - 1 - Enable
 */
/*@{*/
/*! @brief Read current value of the SIM_PWRC_SRPWRDETEN field. */
#define SIM_RD_PWRC_SRPWRDETEN(base) ((SIM_PWRC_REG(base) & SIM_PWRC_SRPWRDETEN_MASK) >> SIM_PWRC_SRPWRDETEN_SHIFT)
#define SIM_BRD_PWRC_SRPWRDETEN(base) (BITBAND_ACCESS32(&SIM_PWRC_REG(base), SIM_PWRC_SRPWRDETEN_SHIFT))

/*! @brief Set the SRPWRDETEN field to a new value. */
#define SIM_WR_PWRC_SRPWRDETEN(base, value) (SIM_RMW_PWRC(base, SIM_PWRC_SRPWRDETEN_MASK, SIM_PWRC_SRPWRDETEN(value)))
#define SIM_BWR_PWRC_SRPWRDETEN(base, value) (BITBAND_ACCESS32(&SIM_PWRC_REG(base), SIM_PWRC_SRPWRDETEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_PWRC, field SRPWRRDY[9] (RW)
 *
 * This bit is soft control to indicate nanoedge PMC is ready when PMC Power
 * dectect is disabled by SRPWRDETEN.
 *
 * Values:
 * - 0 - Not ready
 * - 1 - Assert PMC power output ready
 */
/*@{*/
/*! @brief Read current value of the SIM_PWRC_SRPWRRDY field. */
#define SIM_RD_PWRC_SRPWRRDY(base) ((SIM_PWRC_REG(base) & SIM_PWRC_SRPWRRDY_MASK) >> SIM_PWRC_SRPWRRDY_SHIFT)
#define SIM_BRD_PWRC_SRPWRRDY(base) (BITBAND_ACCESS32(&SIM_PWRC_REG(base), SIM_PWRC_SRPWRRDY_SHIFT))

/*! @brief Set the SRPWRRDY field to a new value. */
#define SIM_WR_PWRC_SRPWRRDY(base, value) (SIM_RMW_PWRC(base, SIM_PWRC_SRPWRRDY_MASK, SIM_PWRC_SRPWRRDY(value)))
#define SIM_BWR_PWRC_SRPWRRDY(base, value) (BITBAND_ACCESS32(&SIM_PWRC_REG(base), SIM_PWRC_SRPWRRDY_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_PWRC, field SRPWROK[16] (RO)
 *
 * Values:
 * - 0 - Power supply for nanoedge isn't ready.
 * - 1 - Power supply for nanoedge is OK.
 */
/*@{*/
/*! @brief Read current value of the SIM_PWRC_SRPWROK field. */
#define SIM_RD_PWRC_SRPWROK(base) ((SIM_PWRC_REG(base) & SIM_PWRC_SRPWROK_MASK) >> SIM_PWRC_SRPWROK_SHIFT)
#define SIM_BRD_PWRC_SRPWROK(base) (BITBAND_ACCESS32(&SIM_PWRC_REG(base), SIM_PWRC_SRPWROK_SHIFT))
/*@}*/

