theatrus/ksdk/platform/devices/MKV43F15/include/MKV43F15_extension.h
/*! @brief Set the DEN3 field to a new value. */
#define XBARA_WR_CTRL1_DEN3(base, value) (XBARA_RMW_CTRL1(base, (XBARA_CTRL1_DEN3_MASK | XBARA_CTRL1_STS2_MASK | XBARA_CTRL1_STS3_MASK), XBARA_CTRL1_DEN3(value)))
#define XBARA_BWR_CTRL1_DEN3(base, value) (BITBAND_ACCESS16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_DEN3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register XBARA_CTRL1, field IEN3[9] (RW)
 *
 * This bit enables the interrupt function on the corresponding XBAR_OUT3
 * output. When the interrupt is enabled, the output INT_REQ3 reflects the value STS3.
 * When the interrupt is disabled, INT_REQ3 remains low. The interrupt request is
 * cleared by writing a 1 to STS3. IEN3 and DEN3 should not both be set to 1.
 *
 * Values:
 * - 0 - Interrupt disabled
 * - 1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL1_IEN3 field. */
#define XBARA_RD_CTRL1_IEN3(base) ((XBARA_CTRL1_REG(base) & XBARA_CTRL1_IEN3_MASK) >> XBARA_CTRL1_IEN3_SHIFT)
#define XBARA_BRD_CTRL1_IEN3(base) (BITBAND_ACCESS16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_IEN3_SHIFT))

/*! @brief Set the IEN3 field to a new value. */
#define XBARA_WR_CTRL1_IEN3(base, value) (XBARA_RMW_CTRL1(base, (XBARA_CTRL1_IEN3_MASK | XBARA_CTRL1_STS2_MASK | XBARA_CTRL1_STS3_MASK), XBARA_CTRL1_IEN3(value)))
#define XBARA_BWR_CTRL1_IEN3(base, value) (BITBAND_ACCESS16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_IEN3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register XBARA_CTRL1, field EDGE3[11:10] (RW)
 *
 * This field selects which edges on XBAR_OUT3 cause STS3 to assert.
 *
 * Values:
 * - 00 - STS3 never asserts
 * - 01 - STS3 asserts on rising edges of XBAR_OUT3
 * - 10 - STS3 asserts on falling edges of XBAR_OUT3
 * - 11 - STS3 asserts on rising and falling edges of XBAR_OUT3
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL1_EDGE3 field. */
#define XBARA_RD_CTRL1_EDGE3(base) ((XBARA_CTRL1_REG(base) & XBARA_CTRL1_EDGE3_MASK) >> XBARA_CTRL1_EDGE3_SHIFT)
#define XBARA_BRD_CTRL1_EDGE3(base) (XBARA_RD_CTRL1_EDGE3(base))

/*! @brief Set the EDGE3 field to a new value. */
#define XBARA_WR_CTRL1_EDGE3(base, value) (XBARA_RMW_CTRL1(base, (XBARA_CTRL1_EDGE3_MASK | XBARA_CTRL1_STS2_MASK | XBARA_CTRL1_STS3_MASK), XBARA_CTRL1_EDGE3(value)))
#define XBARA_BWR_CTRL1_EDGE3(base, value) (XBARA_WR_CTRL1_EDGE3(base, value))
/*@}*/

/*!
 * @name Register XBARA_CTRL1, field STS3[12] (W1C)
 *
 * This bit reflects the results of edge detection for XBAR_OUT3. This field is
 * set to 1 when an edge consistent with the current setting of EDGE3 is detected
 * on XBAR_OUT3. This field is cleared by writing 1 to it or by a DMA_ACK3
 * reception when DEN3 is set. Writing 0 to the field has no effect. When interrupt or
 * DMA functionality is enabled for XBAR_OUT3, this field is 1 when the
 * interrupt or DMA request is asserted and 0 when the interrupt or DMA request has been
 * cleared.
 *
 * Values:
 * - 0 - Active edge not yet detected on XBAR_OUT3
 * - 1 - Active edge detected on XBAR_OUT3
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL1_STS3 field. */
#define XBARA_RD_CTRL1_STS3(base) ((XBARA_CTRL1_REG(base) & XBARA_CTRL1_STS3_MASK) >> XBARA_CTRL1_STS3_SHIFT)
#define XBARA_BRD_CTRL1_STS3(base) (BITBAND_ACCESS16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_STS3_SHIFT))

/*! @brief Set the STS3 field to a new value. */
#define XBARA_WR_CTRL1_STS3(base, value) (XBARA_RMW_CTRL1(base, (XBARA_CTRL1_STS3_MASK | XBARA_CTRL1_STS2_MASK), XBARA_CTRL1_STS3(value)))
#define XBARA_BWR_CTRL1_STS3(base, value) (BITBAND_ACCESS16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_STS3_SHIFT) = (value))
/*@}*/

/* Macros for entire XBARA_SELx register.  */
#define XBARA_SELx(base, outIndex)                (*(volatile uint16_t *)((uintptr_t)&XBARA_SEL0_REG(base) + ((outIndex) / 2U) * 2U))

/* Macros for entire XBARA_CTRLx register. */
#define XBARA_CTRLx(base, outIndex)               (*(volatile uint16_t *)((uintptr_t)&XBARA_CTRL0_REG(base) + ((outIndex) / 2U) * 2U))

/* Set the XBARA_SELx_SELx field to a new value. */
#define XBARA_WR_SELx_SELx(base, outIndex, input) (XBARA_SELx((base), (outIndex)) = ((XBARA_SELx((base), (outIndex)) & ~(0xFFU << (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U)))) | ((input) << (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U)))))

/* Read current value of the XBARA_SELx_SELx field. */
#define XBARA_RD_SELx_SELx(base, outIndex)        ((XBARA_SELx((base), (outIndex)) >> (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))) & 0xFFU)

/* Set the XBARA_CTRLx_IENx field to a new value. */
#define XBARA_WR_CTRLx_IENx(base, outIndex, enable) (BITBAND_ACCESS16(&XBARA_CTRLx((base), (outIndex)), 1U + (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))) = (enable))

/* Set the XBARA_CTRLx_DENx field to a new value. */
#define XBARA_WR_CTRLx_DENx(base, outIndex, enable) (BITBAND_ACCESS16(&XBARA_CTRLx((base), (outIndex)), 0U + (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))) = (enable))

/* Read current value of the XBARA_CTRLx_IENx field. */
#define XBARA_RD_CTRLx_IENx(base, outIndex)       (BITBAND_ACCESS16(&XBARA_CTRLx((base), (outIndex)), 1U + (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))))

/* Read current value of the XBARA_CTRLx_DENx field. */
#define XBARA_RD_CTRLx_DENx(base, outIndex)       (BITBAND_ACCESS16(&XBARA_CTRLx((base), (outIndex)), 0U + (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))))

/* Set the XBARA_CTRLx_EDGEx field to a new value. */
#define XBARA_WR_CTRLx_EDGEx(base, outIndex, edge) (XBARA_CTRLx((base), (outIndex)) = ((XBARA_CTRLx((base), (outIndex)) & ~(3U << (2U + (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U)))) ) | ((edge) << (2U + (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))))))

/* Read current value of the XBARA_CTRLx_EDGEx field. */
#define XBARA_RD_CTRLx_EDGEx(base, outIndex)      ((XBARA_CTRLx((base), (outIndex)) >> (2U + XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))) & 0x3U)

/* Read current value of the XBARA_CTRLx_STSx field. */
#define XBARA_RD_CTRLx_STSx(base, outIndex)       (BITBAND_ACCESS16(&XBARA_CTRLx((base), (outIndex)), 4U + (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))))

